{"-K3HqH0G5xJKm1k6nP3O":{"author1":"lorenzo","author2":"jesus","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"Section 1[n]afdja;j[n]Section 2[n]afdlja;lkj[n]Section 3[n]adsfjj;[n]Section 4[n]afdjal;j[n]This bill will go into effect starting on 2015-11-24","billTitle":"A Bill to test the new billText","division":"dfdf","governorEvaluation":"not yet evaluated","id":"-K3HqH0G5xJKm1k6nP3O","rocketDocketStatus":"no","school":"Riverside"},"-K3JsRVucy6yAiOdOmnF":{"author1":"Katherine All","author2":"Kathryn Simmons","authorLocation":"not yet assigned","billLocation":"A","billStatus":"on the docket","billText":"<h3>Section</h3>1: South Carolina is one of only five states that do not have any laws concerning hate crimes, despite the fact that there were over 50 hate crimes reported in 2013 alone. South Carolina is notorious for its history of prejudice and hate-driven crimes, and according to the Southern Poverty Law Center, there are 19 known hate groups in the state. Increased penalties for hate crimes not only deter smaller crimes such as vandalism or harassment, but according to a study done by the Anti-Defamation League, victims are more likely to report hate crimes if they know there will be a consequence. This bill will create harsher penalties for any misdemeanors or felonies classified as hate crimes. <h3>Section</h3> 2: A hate crime is defined as a crime committed with clear intent to harm a person or property due to their race, religion, color, sex, age, national origin, or sexual orientation. If someone is found guilty of a hate crime, they will be subjected to a fine of 2,000 to 10,000 dollars, and/or a prison sentence of two years to life, depending on the severity of the crime. Additionally, all law enforcement agencies will be required to report any and all hate crimes to the Federal Bureau of Investigations (FBI). <h3>Section</h3> 3: States with laws such as this in place have not experienced large increases in prison sentences, refuting the argument that such laws would lead to additional costs or prison bloating. Instead, penalties for hate crimes lead to reduced overall crime and higher consequences for petty crimes that contribute to racist and damaging ideals. Any additional costs due to extended prison sentences will be covered by fines collected from criminal offenders. <h3>Section</h3> 4: This bill will be enforced by the South Carolina Law Enforcement Division (SLED). <h3>Section</h3> 5: Once signed into law, this bill will go into effect on January 1, 2016.","billTitle":"An Act to Penalize Hate Crimes","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsRVucy6yAiOdOmnF","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Audrey Prochaska and Madeline Durrell"},"-K3JsRfhUUC1KlFQE8sD":{"author1":"Samantha Hutter","author2":"Megan Keech","authorLocation":"not yet assigned","billLocation":"B","billStatus":"on the docket","billText":"<h3>Section</h3>1: Every year, hundreds of thousands of Americans suffer from cardiac arrest while not in a hospital. Cardiac arrest is when the heart stops working due to a malfunction of electrical impulses, which can result in brain damage and death if not treated immediately. In these life-threatening situations, time is everything. A person whose oxygenated blood supply to the brain has been stopped can suffer brain damage within minutes and death in eight to ten minutes. The average first responder response time is eight to twelve minutes and every minute help is delayed a persons chance of survival decreases by ten percent. <h3>Section</h3> 2: Due to the small window of time, people must be able to react immediately and know the skills necessary to attempt to save a persons life. CPR, or Cardiopulmonary Resuscitation, is not only useful in these situations, it is also useful in heart attacks or some near drowning instances, in which a persons heart has stopped. Additionally, knowledge of how to use an AED, or automated external defibrillator, increases the chances of survival in situations where the victim's heart needs to be returned to a normal rhythm. In combination, these skills can save the life of a person in need. <h3>Section</h3> 3: A. In order to provide as many people as possible with these skills, this bill requires all high school students to take a course on performing CPR and AED usage. The course will be a part of the Physical Education curriculum.  B. Exemptions will be available for students with whose IEP or 504 states that he/she is not able to perform the tasks required in the course. Additionally, a doctors note advising of health problems that would cause an inability to perform the tasks required can exempt the student.  C. The district school board shall use an instructional program developed by the American Red Cross, American Heart Association, another nationally recognized program that teaches the most current CPR and AED methods, or a local medical professional, EMS, or other adult certified to teach the most current information by the American Red Cross.  D. This bill will affect all public high school students, beginning with the class of 2020. <h3>Section</h3> 4: Each school board will be responsible for the funding of their teaching method of choice. As long as the program complies with the guidelines set forth in <h3>Section</h3> 3, the district may choose whatever program is best for them financially and logistically. <h3>Section</h3> 5: As stated in <h3>Section</h3> 3, the class will be a mandatory addition to the Physical Education Program. This class is a graduation requirement in South Carolina. Failure to successfully complete this training will result in the withholding of the credit until the student completes the course. The certified instructor will determine if a student passes the training based on the most current standards. Schools will be responsible for the recording of this information. <h3>Section</h3> 6: This bill will go into effect August 1, 2016.","billTitle":"An Act to Require All High School Students to Attend CPR and AED Training","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsRfhUUC1KlFQE8sD","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Anna Davidson and Meaghan Price"},"-K3JsRqF7O1lWF6DztA9":{"author1":"Bridget Cowen","author2":"Mary Flatt","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"<h3>Section</h3>1: All drivers over the age of 75 will be required to retake the basic road  skills test, along with the visual and hearing tests currently administered. <h3>Section</h3> 2:    The road skills test will be retaken every 5 years after the age of 75.   The visual and hearing tests will be retaken every two years after the age of 75, and can be approved by a personal doctor. <h3>Section</h3> 3:  When signed into law, this bill will go into effect on January 1, 2016.","billTitle":"An Act for Safer Roads","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsRqF7O1lWF6DztA9","rocketDocketStatus":"no","school":"A.C. Flora High School","sponsor":"Hugh Aiken and Patrick Wright"},"-K3JsS-q5SH7vr7sdB5K":{"author1":"Oliver Chartock","author2":"Harris Rogers","authorLocation":"not yet assigned","billLocation":"D","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state average of school start time is somewhere between  7:30-8:30. This bill would increase that time to 9:00. <h3>Section</h3> 2: The state wide time would increase to 9:00, so the state time would be  uniform across the state. <h3>Section</h3> 3: This bill protects the students of South Carolina and will help improve  their performance in school and their development in life. <h3>Section</h3> 4: The benefits of this bill:   Teenagers need an average of 9  hours of sleep per night for optimal performance, health and brain development.   A 70% drop in car crashes involving teen drivers after an 80-minute delay in the start time at one high school.   A one-hour delay in start time increases standardized test scores on both math and reading tests by roughly 3 percentile points. <h3>Section</h3> 5:  When signed into law, theClear formatting and concise descriptions make for better debate and clearer                understanding! Clear formatting and concise descriptions make for better debate and clearer                understanding! of the 2016-2017 school year.","billTitle":"An Act to Change the Start of School to 9:00am","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsS-q5SH7vr7sdB5K","rocketDocketStatus":"no","school":"A. C. Flora High School","sponsor":"Hugh Aiken and Patrick Wright"},"-K3JsSAmlu2XQul9idow":{"author1":"Nolan Anderson","author2":"Ch","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current tax rates on small businesses in the State of South Carolina range from 5% to 6% and state income taxes on their owners range from 6% to 8%. This is roughly an average of $12,000 in business taxes and $4,300 in income taxes. This bill would allow new small businesses to be exempted from paying any taxes for one year after they open their business in the State of South Carolina, and their owners would be exempted from paying income taxes for one year. <h3>Section</h3> 2:  As stated by the United States Department of Labor, 80% of small businesses fail within the first 18 months. This bill would cut the taxes stated above to 0% for the first year after a business opens, and would exempt the business owner from paying income tax for the first year. According to financial analysts, a proposal like this would save the average small business owner in SC roughly $20,000 in taxes. It also predicts that this would raise the rate of small-businesses in the State of South Carolina by roughly 20%, adding at least $50,000,000 to our state revenue, within the first 3 years of this bill being enacted. This is supported by financial analysts, but also by former projections when South Carolinas economy grew by 3.4% in two years with a 3% decrease in overall taxes. This bill would allow many people in poorer areas of the state to make their dreams come true and open a small business while focusing on paying their lease or rent and building a client base. <h3>Section</h3> 3:  We will grow the economy by allowing more businesses to stay-open with the money saved from the decrease in taxes. We would also benefit as we would take the top ranking for Business Insiders best states for small business, which would help grow our population in addition to 4.5% growth we already experience. <h3>Section</h3> 4:  Overall provisions for this bill:   Small businesses would be tax exempt for one year after opening.   Owners would be exempt from income taxes for one year.   After the one year is up, they will pay 50% of the tax rate the second year, and will then return to pay the original taxes the third year.   Small business that pay their workers over $10.00 an hour will be given subsidies in an attempt to raise wages in the state.   The overall revenue gained would go towards infrastructure, education, and a government sponsored organization that helps create small businesses. <h3>Section</h3> 5: When signed into law, this new tax policy will go into effect on April 15th, 2016.","billTitle":"An Act to Allow New Small Businesses and Their Owners to be Tax Exempt for One Year after Opening","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsSAmlu2XQul9idow","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3JsSLl0QFE1MawWayZ":{"author1":"Shelby Askins","author2":"Cristina Waingart","authorLocation":"not yet assigned","billLocation":"F","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, in the state of South Carolina, there is no program available for students to have access to information missed in the classroom. <h3>Section</h3> 2:  When a student is absent from class, important information can be lost amongst the multitude of makeup work received when returning to school. Students also miss information in the class due to distractions and other mishaps. The recording of lessons will allow absent students to have the same teaching as if they were in classroom. Students who are misinformed or confused can access the teachings to provide clarity. <h3>Section</h3> 3:  Every classroom is required to have a live recording of the teaching for that day. The teacher will have a microphone; it will act as a remote that can turn the recording on and off, so that students can listen in on the lesson. The student will be able to watch the presentation using an application that allows a visual of the board with a podcast of the lesson. <h3>Section</h3> 4:  The program will only be accessed by students who have a school-provided student identification and password. The recording of live teaching sessions will allow access for 48 hours, then it is deleted. Students who cannot participate in the live sessions have the option of saving the recordings to be replayed at a later time. <h3>Section</h3> 5: Benefits of letting students have access to live classroom teachings include:   Students wont fall behind because of illness or distractions.    Teachers will be more accountable for their lessons and teaching.   Students who are not absent will also gain from the program, and teachers will spend less time trying to get everyone on the same level of learning. <h3>Section</h3> 6: When signed into law, the bill will take effect in the 2016-2017 school year. SOUTH CAROLINA YMCA  YOUTH IN GOVERNMENT  28th Annual Model Legislature  November 18-21, 2015","billTitle":"An Act to Provide Access to Live Teaching in the Classroom","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsSLl0QFE1MawWayZ","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3JsSWPf-I2T3wjqMiP":{"author1":"Lauren Drake","author2":"Mary Ch","authorLocation":"not yet assigned","billLocation":"A","billStatus":"on the docket","billText":"<h3>Section</h3>1: An act to prohibit smoking in a vehicle in which minors are present. <h3>Section</h3> 2: Adults found smoking in a car with a minor will be fined $100 for each offense. <h3>Section</h3> 3: State, County, and Local law enforcement will be authorized to administer tickets. <h3>Section</h3> 4:  All laws or parts of laws in conflict with this bill are herewith repealed to the extent of the conflict. <h3>Section</h3> 5: The importance of this legislation demands immediate passage. <h3>Section</h3> 6: This act shall take effect ninety days after the approval of the Youth Governor.  SOUTH CAROLINA YMCA  YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18-21, 2015","billTitle":"Smokefree Cars Containing Minors","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsSWPf-I2T3wjqMiP","rocketDocketStatus":"no","school":"Southside Christian School","sponsor":"Lizzy Voigt and Cole Bensch"},"-K3JsSgSsy7Q42C3iAzf":{"author1":"Laura Workman","author2":"Sydney Self","authorLocation":"not yet assigned","billLocation":"B","billStatus":"on the docket","billText":"<h3>Section</h3>1: As it stands, the seat belt law of South Carolina only fines the offenders $25 for their first offense. The fine will be increased to $75. <h3>Section</h3> 2: The state fines will increase by $10 increments over a five year period. Thus, the state fine by January 1, 2021 will stand at $75 per violation. <h3>Section</h3> 3: The purpose of such an increase in fees is to prevent possible fatalities of all ages in automobile accidents. <h3>Section</h3> 4: Results of the increased fine should include:   Higher rate of survival in automobile accidents;   Stricter adherence to the seat belt laws already in place;   More funding for the DMV, road improvement, and other programs. <h3>Section</h3> 5: When signed into law, the first fine increase and age limit will occur on January 1, 2016. The final increase will occur on January 1, 2020.","billTitle":"An Act to Tighten Security Laws on Seat Belts","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsSgSsy7Q42C3iAzf","rocketDocketStatus":"no","school":"Southside Christian School","sponsor":"Jacob Day and Palmer Morris"},"-K3JsSrEH5P7O8BE7s9c":{"author1":"Harrison Flowers","author2":"Price Rainwater","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"<h3>Section</h3>1:   Currently South Carolina is ranked as the 10th most obese state in the  nation with 32.1% of adults being obese. Obesity is a serious and expensive disease  costing the United States 147 billion dollars annually in medical costs and raising  individual healthcare expenses by $1,429. (Statistics taken from the cdc.gov and  stateofobesity.org/states/sc) <h3>Section</h3> 2: The purpose of this bill is to inform South Carolinians so that they might  make better food choices and ultimately reduce the obesity rate in South Carolina. <h3>Section</h3> 3: South Carolina will require all food and drink advertising distributed or  displayed in state to represent caloric values. This includes but is not limited to:   Bill boards   Newspaper circulars   Mail coupons   Posters <h3>Section</h3> 4: Caloric values must be clearly and legibly indicated.   The caloric value should be of a size that covers 8% of the total area of the advertisement.   The caloric value cannot be obscured by other words or images. <h3>Section</h3> 5: This bill will cost South Carolina no money as individual businesses will be  required to cover any costs of calculating caloric count or changing advertisements. <h3>Section</h3> 6: Businesses with current long-term advertisements (i.e. bill boards) will be  required to change or take down advertisements within six months of the passage of  this bill. <h3>Section</h3> 7: Failure to display caloric value or change current advertisements will result in a fine of $1,500 for each offense/advertisements published and will be enforced by the South Carolina Department of Health and Environmental Control.   Money from fines will be added to the education budget for South Carolina   This will result in better funding and education of health and physical education classes to better inform students of healthy choices. <h3>Section</h3> 8: This bill does not pertain to radio, television, or internet advertising. <h3>Section</h3> 9: When signed into law this bill will take effect on January 1, 2016.","billTitle":"An Act to Require the Display of Caloric Values on South Carolina Advertising","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsSrEH5P7O8BE7s9c","rocketDocketStatus":"no","school":"South Florence High School","sponsor":" "},"-K3JsT13UqU5VCjjOx8l":{"author1":"Quinn Divers","author2":"Morgan Reynolds SCHOOL/CLUB:  Brashier Middle College Charter High School   A BILL TO BE ENTITLED   An Act to Institute R","authorLocation":"not yet assigned","billLocation":"D","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current law in South Carolina does not include mandatory random drug testing for welfare recipients. <h3>Section</h3> 2: Mandatory drug testing for welfare recipients would occur for anyone applying for or using welfare. <h3>Section</h3> 3: Drug Testing would be randomized and not announced in advance. To determine who will be selected, there will be a random selection of social security numbers from the South Carolina Department of Social Services. Numbers will be evenly distributed across the state. After welfare recipients are selected, a date will be chosen for recipients to test. DSS employees will be trained in administering the test. If the drug test is skipped or missed without notifying officials, a warrant will be put out for the welfare recipient's arrest. If recipient cannot attend and clears it with the DSS, the date can be rescheduled and made up. <h3>Section</h3> 4: This would decrease the number of welfare recipients that use illegal drugs in the state of South Carolina. If test isnt passed by the welfare recipient, he/she will be placed in a State Sponsored rehabilitation center and will forgo welfare for six month period. <h3>Section</h3> 5: In order to pay for this drug testing there would be an increase on tobacco taxes by 5 cents. <h3>Section</h3> 6: When signed into law, the randomized drug testing will start to take place on January 1, 2016","billTitle":"An Act to Institute Random Drug Tests for Welfare Recipients","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsT13UqU5VCjjOx8l","rocketDocketStatus":"no","school":"Brashier Middle College Charter High School","sponsor":"TES IN: Senate BILL NUMBER: S10 RECOMMENDED FOR COMMITTEE: D AUTHORS:  Quinn Divers and Morgan Reynolds"},"-K3JsTByeUCEStDBi6Br":{"author1":"Lea Tierney","author2":"Riley Chafer","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state compulsory attendance law requires students in school to attend at least 170 days and are allowed 10 days of lawful, unlawful, or a combination of absences. Excess unexcused absences can lead to the denial of credit for a class. <h3>Section</h3> 2: Final exams, whether state or federally given, generally occur two weeks prior to the final date of the school year. By law, students are still required to attend school after exams are over to reach the appropriate amount of seat time necessary. However, after final examination takes place, new material is rarely, if at all, taught. This makes it unnecessary for a 12th grade student who has met all of the requirements for graduation to continue to attend class. <h3>Section</h3> 3: The bill would exempt all qualifying high school students in South Carolina from attending a class after they have completed and passed the standardized, summative exam for that particular course. <h3>Section</h3> 4: A qualifying student is defined as underclassmen who have a 3.8 GPA or higher or a senior who has met the graduation requirements may be exempt from attending class past such final examinations. This would act as an incentive for succeeding students and will help motivate students to maintain a better GPA throughout the school year. <h3>Section</h3> 5: Underclassmen is defined as a high school student enrolled as a student full time in any taxpayer funded high school in South Carolina with enough credit hours to qualify them as a senior.  Students with less than the required credit hours will not qualify. <h3>Section</h3> 6: When signed into law, this will take effect in the 2016-2017 school year.     BILL ORIGINATES: Senate BILL NUMBER: S12 RECOMMENDED FOR COMMITTEE: F AUTHORS: McCall Faciszewski and Josh Perri BILL SPONSOR: Abler, Hubner SCHOOL/CLUB: Bluffton High School  A BILL TO BE ENTITLED  An Act to Make South Carolina Schools Safer  BE IT HEREBY ENACTED BY THE YMCA MODEL LEGISLATURE OF SOUTH CAROLINA <h3>Section</h3> 1: Currently, students that attend Public School in South Carolina are allowed to attend school without receiving necessary vaccinations through Medical, Religious, and Special Exemptions. <h3>Section</h3> 2: When passed, this legislation will mandate that all students that are not vaccinated without having the necessary medical exemption will not be allowed to attend public schools. <h3>Section</h3> 3: If parents do not make other arrangements for their childs education, or do not ensure that their children receive the necessary vaccinations within 30 days, the student will be enrolled in one of South Carolinas several free virtual schools, up to the parents discretion. <h3>Section</h3> 4: If students wish to join any extracurricular athletics or academic activities within their school district, students must have a full physical completed showing that they are cleared and in good health in order to participate. <h3>Section</h3> 5: Students wishing to enter private or parochial school or a private day care have the right to still use the religious exemption, providing that the institution allows them to use it. <h3>Section</h3> 6: Whenever students prove that they have received the necessary vaccinations, which are outlined by the South Carolina Department of Health and Environmental Control (SCDHEC) at the beginning of every school year, students will be immediately allowed to enter public school again. <h3>Section</h3> 7: When enacted, students who are not vaccinated, and do not have the medical exemption will be given 30 days to either receive the necessary vaccinations or be withdrawn for public school. Any students who try to enter South Carolina public schools without medical or special exemptions will not be admitted.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT  28th Annual Model Legislature November 18-21, 2015","billTitle":"An Act to Exempt High School Seniors From Attending Class After Final Testing","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsTByeUCEStDBi6Br","rocketDocketStatus":"no","school":"Bluffton High School","sponsor":"Annie Franklin and Sophie Albert"},"-K3JsTNBhVR0i6l6NIh6":{"author1":"Molly Pyle","author2":"Hayden Pruitt","authorLocation":"not yet assigned","billLocation":"A","billStatus":"on the docket","billText":"<h3>Section</h3>1: The maximum legal interest rate to be charged on a state student loan would be 7% APR. <h3>Section</h3> 2: Loaners would be able to choose between having a maximum interest rate of 5% with a minimum three-month grace period or having a minimum six  month grace period with a maximum interest rate of 7%. <h3>Section</h3> 3: If loaners do not follow this law, they will be fined $1,000 per loan given that does not meet the new requirements. <h3>Section</h3> 4: When signed into law, this cap on interest rates for student loans will take  effect on June 1, 2016.","billTitle":"An Act to Lower Interest Rates for Student Loans","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsTNBhVR0i6l6NIh6","rocketDocketStatus":"no","school":"Riverside High School","sponsor":"Bailey Yerby and Bay Prewette"},"-K3JsTXsaefjoqjZY2U6":{"author1":"Zee Evans","author2":"Kevon Johnson","authorLocation":"not yet assigned","billLocation":"B","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state law for domestic abuse is not recognized at the same level in same sex relationships. <h3>Section</h3> 2:  The new law would make punishments for domestic violence the same for both heterosexual and same sex relationships. <h3>Section</h3> 3:  Immediate consequences are needed for the following reasons:   Nearly 1 in 4 people have experienced violence by their spouse or partner.    More than 7 million children have and do live in families in which domestic violence occur.    Almost 500 women are beaten and sexually assaulted each day in South Carolina and this includes women in same sex relationships   Research indicates that domestic violence among same-sex couples occurs at similar rates as domestic violence among straight couples. Unfortunately, domestic violence victims in same-sex relationships are not receiving the help they need. This is due to the lack of legal recognition of same-sex relationships.   Domestic Violence also involves male victims and those males involved in same sex relationships <h3>Section</h3> 4:  Revenue from this tax would fund:   Education to prevent domestic violence in all relationships   Money would assist with housing recovery of all victims    Money would be used to create safe houses and educational awareness for all victims <h3>Section</h3> 5:  When signed into law, the first increase will take place on January 1, 2016.","billTitle":"An Act to Mandate Immediate Levels of Punishment on Domestic Violence in Same Sex Relationships","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsTXsaefjoqjZY2U6","rocketDocketStatus":"no","school":"Pickens County Career Center  C3","sponsor":" "},"-K3JsThMNv-Ksgf1NOmI":{"author1":"Rachael Keown","author2":"Jessica Garlington","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, there is no limit on the number of chances a parent has to regain custody of their children after the Department of Social Services has placed them in foster care. <h3>Section</h3> 2: Because there is no limit to the number of chances a parent has to regain custody, children in foster care are not being raised in the proper environment. <h3>Section</h3> 3: Once a child is removed from his home, parents should be given the opportunity to regain custody after completing a treatment plan. If the child is removed from the home a second time, parental rights will automatically be terminated and the child will be placed into a foster home to be cared for, ensuring that the child grows up in the best possible environment. <h3>Section</h3> 4: The termination of parental rights after DSS has taken custody for the second time would:   Prevent kids from moving in and out of foster care throughout their childhood   Decrease the amount of emotional and physical scarring on the child   Ensure that the child grows up in a more stable environment leading to a more successful future. <h3>Section</h3> 5: When signed into law on January 1, 2016, the state will be required to terminate parental rights after the second removal from a home.","billTitle":"An Act to Limit Regaining of Lost Parental Custody of Children","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsThMNv-Ksgf1NOmI","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3JsTs8OSaOPClsTHwW":{"author1":"Donald Aiken","author2":"Mac Pitts BILL SPONSORS:  Jeffrey Butcher","authorLocation":"not yet assigned","billLocation":"D","billStatus":"on the docket","billText":"<h3>Section</h3>1: This act will ban the sale of bath salts to people under the age of eighteen in the state of South Carolina in order to lower the usage of bath salts as a drug among teenagers. <h3>Section</h3> 2:  Bath salts will be available over the counter but will require an ID to purchase. <h3>Section</h3> 3:  Sales to minors will result in fines for the offending business owner. <h3>Section</h3> 4: When signed into law, this ban would come into effect January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 27th Annual Model Legislature November 18th-21st","billTitle":"An Act to Ban the Sale of Bath Salts to the Underaged Individuals","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsTs8OSaOPClsTHwW","rocketDocketStatus":"no","school":"Spartanburg Day School","sponsor":"TES IN: Senate BILL NUMBER: S16 RECOMMENDED FOR COMMITTEE: D AUTHORS: Donald Aiken and Mac Pitts BILL SPONSORS:  Jeffrey Butcher and Will Webster"},"-K3JsU1zc1gkmUCSoFjt":{"author1":"Devin Srivastava","author2":"Matthew Poliakoff BILL SPONSORS: Curry Sherard","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: This factory will be built in North Charleston.   The factory will be constructed by the South Carolina government, but operated by a private contractor such as General Dynamics (which currently operates the factory in Ohio). The formation of this single plant would bring over 1,000 jobs to the lowcountry region.    While the Lima, Ohio Tank factory is currently only equipped to construct M1A1 Main Battle Tanks, the proposed North Charleston Tank Factory (NCTF) would be able to construct other kinds of armored vehicles such as Armored Personnel Carriers and Light Battle Tanks. The NCTF would also be able to upgrade and repair armored vehicles in the US army.   The construction of this plant would double the United States Militarys tank production capability, bring over 1,000 jobs at the region, and put South Carolina at the forefront of the war against the enemies of the United States of America. <h3>Section</h3> 2: Currently, the city of North Charleston is the largest city with the highest unemployment rate in the state. It is the third most populous city in the state as well. This bill would provide economic growth to the region, along with a contribution to the power of the United States military directly from the people of South Carolina. <h3>Section</h3> 3: When signed into law by the Honorable Youth Governor, this bill will go into effect on March 1, 2016.","billTitle":"An Act to Create the Second Tank Factory in the United States","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsU1zc1gkmUCSoFjt","rocketDocketStatus":"no","school":"Spartanburg Day School","sponsor":"TES IN: Senate BILL NUMBER: S17 RECOMMENDED FOR COMMITTEE: E AUTHORS: Devin Srivastava and Matthew Poliakoff BILL SPONSORS: Curry Sherard and Liza Genoble"},"-K3JsUCd6RgcW0buMLgC":{"author1":"Adrienne Johnson","author2":"Jackson Crouse","authorLocation":"not yet assigned","billLocation":"F","billStatus":"on the docket","billText":"<h3>Section</h3>1: South Carolina does not have a state law requiring employers to offer paid maternity leave. <h3>Section</h3> 2: This bill would require employers to offer paid leave to their pregnant female employers. <h3>Section</h3> 3: The bill would require a minimum of three months paid maternity leave, one-month prior, two months after pregnancy. <h3>Section</h3> 4: All of the money paid to the mother will come from the companies with the amount paid not allowed below 75% of the normal pay. <h3>Section</h3> 5: This bill, if signed into law, will be enacted Sunday May 8th, 2016, Mothers Day.","billTitle":"An Act to Guarantee Pregnant Mothers Maternity Leave","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsUCd6RgcW0buMLgC","rocketDocketStatus":"no","school":"Bishop England High School","sponsor":"Sam Lemon and Lulu McMillan"},"-K3JsUNzDoKTYllsLpmp":{"author1":"Arpit Maini","author2":"Remy Skerjanz","authorLocation":"not yet assigned","billLocation":"A","billStatus":"on the docket","billText":"<h3>Section</h3>1: Prostitution will be legalized under the following rules and regulations. <h3>Section</h3> 2: This law would allow any male or female to apply for a license to become a legal prostitute within the confines of South Carolina. <h3>Section</h3> 3: In order for the male or female to receive a license to work under a registered brothel, he or she must prove medically that they have no Sexually Transmitted Infections (STI). The applicant must pass a mandatory drug test. They must meet a legal age limit of 18 years. Persons that sign up for a license permit themselves to undergo mandatory STI tests on a weekly basis. Condoms are required to be worn by all male prostitutes and customers. A recent study published in the American Journal of Public Health reveals that of the combined 3,290 clients of forty different legal sex workers, not one received penetrative sex without a condom. This information contrasts greatly with the realities of street prostitution. Women working without the protection of brothel management are often intimidated or forced to perform these same services without the benefit of safeguards for their health. Persons that believe that they have contracted an STI from a prostitute may press charges if they provide sufficient evidence that they received the STI while obtaining the services from the brothel in question, and vice-versa. Prostitutes may only work within the confines of brothel in which they are employed. If any rules and regulations are not followed, licenses will be suspended until all rules and regulations are met. If standards are not met within a certain period of time, licenses will be revoked. <h3>Section</h3> 4: Businesses must be licensed in order to become a brothel. To acquire a license, a business must pay a licensing fee. The license will only allow for a certain amount of prostitutes to be employed at any one time. The price of the license will rise incrementally as the amount of prostitutes employed rises. Brothels are subjected to random checks from the Health Department annually. <h3>Section</h3> 5: The commercial licensing fee would be 100,000 dollars annually. For every additional 15 prostitutes employed, and extra 50,000 dollars will be added annually. All profits are subjected to state, city, and federal income tax. Businesses may decide rate for services and payment of employees. <h3>Section</h3> 6: This would allow for:   The brothel to safely and legally obtain money for sexual intercourse/oral sex.   People to safely and legally purchase sexual intercourse/oral sex.   The freeing up of space in state/county prisons.   Large amounts of money raised for state projects.   large decrease in street solicitation for prostitutes.   Influx of money within the state.   Decrease in drug usage among prostitutes.   large decrease in human trafficking rates.   Decrease in illegal solicitation of prostitutes on streets.   Decrease in Sexually Transmitted Infections.   Decrease in the amount of money spent prosecuting women and men.   Increased safety for women currently working on streets. <h3>Section</h3> 7: When signed into law the bill will be enacted on January 1st, 2016.","billTitle":"An Act to Legalize Male and Female Prostitution Within a Commercial Organization","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsUNzDoKTYllsLpmp","rocketDocketStatus":"no","school":"Spartanburg High School","sponsor":""},"-K3JsUYwV5O9iCdLM22a":{"author1":"Jonathan Cope","author2":"Hudson McKinney","authorLocation":"not yet assigned","billLocation":"B","billStatus":"on the docket","billText":"<h3>Section</h3>1: South Carolina will prohibit anyone from wearing their pants  unnecessarily lower than what is widely regarded and accepted as the normal position of ones pants.  This law would be enforced in all public areas. <h3>Section</h3> 2:    Sagging is a potential hazard to the sagger.  Sagging has been a direct cause of many incidents leading to hospitalizations pertaining to injury.   Sagging would also be classified as indecent exposure in public. <h3>Section</h3> 3:  First time offenders would be given a warning and a belt.  Second time  offenders would be fined $100 and the fine would increase by $10 increments after  each successive offense. <h3>Section</h3> 4: The revenue from this bill would go towards public education where the  state legislature sees fit. <h3>Section</h3> 5: Upon passage, the law will go into effect January 2, 2016.","billTitle":"An Act to Prohibit Sagging Pants","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsUYwV5O9iCdLM22a","rocketDocketStatus":"no","school":"Spartanburg High School","sponsor":""},"-K3JsUigstmoS3QRZ6SC":{"author1":"Nathalie C","author2":"anoza","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, schools across the state are spending unnecessary amounts of time and money to dispose of toxic polystyrene trays, which is a problem that could be easily solved by switching to decomposable trays. <h3>Section</h3> 2: Styrene, a major chemical component of polystyrene tray, is a toxic pollutant and leads to:   Creates hazardous working conditions and waste,   Found to leach into the food that is put in trays, which is then served to the students,   And could possibly be scraped off and eaten by students who scrape the tray while eating. <h3>Section</h3> 3: The shift to decomposable trays will be done by school districts, starting in the Upstate and working its way south and toward the East Coast, in a 6-month time period. <h3>Section</h3> 4: For this shift to take place, there would not have to be an additional tax, because instead of using the money already in the budget to buy polystyrene trays, the money will now be allocated for the purchasing of decomposable trays. <h3>Section</h3> 5: Since there will now be money left over from buying the cheaper decomposable trays, the tax money can now be used to fund:   The hiring of new teachers,   The improvement of school lunches to healthier choices,   And the purchasing of new materials for the classrooms and for the students. <h3>Section</h3> 6: When signed into law, the first shift to disposable trays will take place December 15, 2015.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature  November 18-21, 2015","billTitle":"An Act to Eliminate Polystyrene Trays","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsUigstmoS3QRZ6SC","rocketDocketStatus":"no","school":"Hillcrest High School","sponsor":"Bray, Arnold"},"-K3JsUtcOADnZ7vHBCDY":{"author1":"Elizabeth Herring","author2":"Adelaide Dixon","authorLocation":"not yet assigned","billLocation":"D","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, in the state of South Carolina, anyone over the age of 16 can operate a boat with no license or restrictions. Anyone under this age can operate a boat alone, that is powered by less than 15 horsepower, or over 15 horsepower in the presence of someone 18 years or older. They must also have passed a boating safety course approved by the South Carolina Department of Natural Resources. <h3>Section</h3> 2: The required age for operating a boat would be changed to age 12 and older, as long as that person has passed a boating safety course and has a boating license. <h3>Section</h3> 3: Because anyone at and above the age of 16 needs a license to legally operate a car, operating a boat should also be regulated at all ages through a license. After the age of 12, a person can take a course given by the Department of Natural Resources that, if passed, will grant them a boaters license that will let them operate a boat alone. This license will have to be renewed every 10 years. <h3>Section</h3> 4: Changing this age would:   The number of boating deaths in SC in 2014 was between 1 and 2.9 fatalities per 100,000 registered boats. South Carolina was fourth in the nation for boating deaths in 2013. This change of a mandatory license would increase the safety in the water.   Prevent young children from having the right to operate a boat when they do not even know the responsibilities.   Make people pay for license just like they have to for driving. This would go to the state helping with the coast guard and marinas. <h3>Section</h3> 5: When signed into law, the first changes will take place on January 1st 2016.","billTitle":"An Act to Require a Boating License for All Ages","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsUtcOADnZ7vHBCDY","rocketDocketStatus":"no","school":"Porter-Gaud School","sponsor":" "},"-K3JsV3KVyCssa6aAuqJ":{"author1":"Jordan Esopa","author2":"Olivia Mitros","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current free pre-k program Head Start would be replaced by a free public Pre-k program available to all schools in South Carolina. <h3>Section</h3> 2: The South Carolina Educational Lottery would now fund a public pre-k program instead of the HOPE scholarship. The scholarship spends approximately 136,000,000 a year which would cover public pre-k in all South Carolina schools. <h3>Section</h3> 3: Due to the tendency of childrens brains and attitudes to form in the first five years of their life, an additional free year of learning is critical for proper and on-track education. Children with this extra year of preparation will have a better transition into kindergarten leading to a better chance of success. This opportunity would also defy several social barriers for each child involved by giving them the opportunity to interact directly with other children prior to entering grade school. All of these factors would attribute to a higher passing rate and lower dropout rate within schools. As well as a higher graduation rate, students would be finishing high school with higher GPAs and test scores. This would qualify them for the LIFE scholarship with more money being granted than the HOPE. <h3>Section</h3> 4: Revenue from the Educational Lottery would fund:   Teacher pay and benefits;   Added classrooms if necessary;   Classroom supplies. <h3>Section</h3> 5: When signed into law, the first year of public Pre-K will begin August 16, 2016.","billTitle":"An Act to provide free Pre-Kindergarten in the state of South Carolina","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsV3KVyCssa6aAuqJ","rocketDocketStatus":"no","school":"Hillcrest High School","sponsor":"Cosgrove, Toft"},"-K3JsVE58HyxYA5fs839":{"author1":"Simone H","author2":"field","authorLocation":"not yet assigned","billLocation":"F","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, waiters and waitresses that are tasked with cleaning tables must use a rag to clean up the waste, and many do not replace their rags for hours on end, resulting in a dirty and unsanitary restaurant and dining experience. <h3>Section</h3> 2: Instead of using these dirty rags to clean up a mess, waiter and waitresses will be required to use disposable a clean, new disposable wipe for every table to keep the restaurant sanitary for the guests. The funding for the purchase of the disposable wipes would be 2 cents added to the tax tacked on to the final bill at a restaurant. <h3>Section</h3> 3: The changing of these rules would affect:   The health and safety of customers and employees.   The environment for dining.   The hygiene of a restaurant. <h3>Section</h3> 4: When signed into law, the first increase will take place January 1, 2016.","billTitle":"An Act to Change From Rags to Disposable Wipes","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsVE58HyxYA5fs839","rocketDocketStatus":"no","school":"Porter-Gaud School","sponsor":" "},"-K3JsVPLZ4A-dOKbr8nR":{"author1":"Emily Kaufman","author2":"Alexis Goodson","authorLocation":"not yet assigned","billLocation":"A","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Currently there are no state wide regulations for parasailing companies in South Carolina. <h3>Section</h3> 2: A statewide parasailing regulation would be implemented to prevent parasailing when wind speeds are over 18 miles per hour or when wave height is greater than 5 feet. This policy will help prevent parasailing related injuries and improve the safety of the activity. <h3>Section</h3> 3: Each parasailing operator would be required to retain a weather log detailing the date, time, wind speed, and wave height for every outing. Weather logs will be provided by and submitted to the Coast Guard every three months. <h3>Section</h3> 4: Coast Guard boats would continue to monitor waters to ensure that no one is parasailing in unsafe weather conditions. <h3>Section</h3> 5: For violators of this act, punishments are as indicated below:   For operations that fail to submit weather log:    1st offense: A fine of $200 will be imposed on the operator.   2nd offense and beyond: A fine of $200 will be imposed on the operator along with a 3 month suspension from operation.   For operations that run during unsafe weather conditions:   1st offense: A $200 fine and 3 month suspension from operation will be imposed.   2nd offense and beyond: A $500 fine and revocation of license to operate will be imposed. <h3>Section</h3> 6: When signed into law, this act will be effective January 1, 2016.","billTitle":"An Act to Regulate Parasailing","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsVPLZ4A-dOKbr8nR","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Jared Prince"},"-K3JsV_-Q-ZZEyWKDGTg":{"author1":"Jonathan Nichols","author2":"Trey Yanity","authorLocation":"not yet assigned","billLocation":"B","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state regulated school week consisting of five days (public schools) would be reduced to four, eliminating all Fridays from each school week. <h3>Section</h3> 2: The state regulated school week will be reduced by one day to four days a week. The total amount of school days would be reduced to 148 days of school. <h3>Section</h3> 3: Because eliminating all Fridays would cause school systems to lose a total of 224 hours in a school year, one hour and forty-five minutes would be added onto each day, compensating for the lost time. This would result in an additional fifteen minutes to each class period. <h3>Section</h3> 4: The reduction of the state regulated school week would:   Limit the amount of money spent on school lunches prepared for Fridays;   Reduce the amount of money spent on heating and air conditioning used on Fridays;   Cut the cost of transportation to school used on Fridays. <h3>Section</h3> 5: When signed into law, this bill will take effect on July 1, 2016.","billTitle":"An Act to Reduce the Amount of Regular School Days in a Week","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsV_-Q-ZZEyWKDGTg","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Austin McNulty"},"-K3JsVjo-6QWv2DFt3uK":{"author1":"Jacob Rabinovitch","author2":"Justin Smith","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"<h3>Section</h3>1: We all know that modern education as it exists today is an impractical and inefficient use of a students time. Many studies have been performed that show that modern education in not effective in preparing our children for their future. <h3>Section</h3> 2: This bill proposes a bypass to the inefficiency by allowing those equipped with lifes most essential resource (money) to basically buy their diploma without having to waste lifes second most essential resource (time). Since money and time are paramount for success, why not use one to gain more of the other? Many upper class South Carolinians that already have the means to succeed in life are forced to attend school and graduate in order to fulfill social norms. This bill eliminates that dreadful situation, all the while reducing the average amount of students per class, allowing for more one on one teacher/ student interactions. <h3>Section</h3> 3: Pricing would be set as follows: $100 for elementary school, $500 for middle school, $1,000 for a high school diploma, $100,000 for a Bachelors degree, $200,000 for a Masters degree, or $500,000 for a PhD. The funds collected through this process would dramatically increase state revenue, and the profits would be allocated to bettering SC infrastructure, as well as to public institutions of higher learning. <h3>Section</h3> 4: If signed into law, this bill will become effective upon the start of the 2016-2017 school year.","billTitle":"An Act to Introduce an Education Buy Out Program","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsVjo-6QWv2DFt3uK","rocketDocketStatus":"no","school":"SC Governors School for Science and Mathematics","sponsor":" "},"-K3JsVuVWHpT1HzYtEuB":{"author1":"David Schmitt","author2":"Samah Malik","authorLocation":"not yet assigned","billLocation":"D","billStatus":"on the docket","billText":"<h3>Section</h3>1: A hate crime is defined as criminal offense against a person or property motivated in whole or part by bias against a race, religion, disability, ethnic origin, sexual orientation, or homelessness. <h3>Section</h3> 2: A person who commits a hate crime must be fined in the digression of the court or imprisoned not more than ten years, or both, as an additional penalty for committing a hate crime. <h3>Section</h3> 3: Data will be recorded the hate crime in order to create an accurate statistical record of hate crimes in South Carolina. <h3>Section</h3> 4: Committing a hate crime creates a civil cause of action in addition to the criminal penalties for hate crimes. <h3>Section</h3> 5: When signed into law, this bill will become fully effective on January 1, 2016.","billTitle":"An Act to Create Penalties for Misdemeanor Hate Crimes","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsVuVWHpT1HzYtEuB","rocketDocketStatus":"no","school":"SC Governors School for Science and Mathematics","sponsor":" "},"-K3JsW4UoDY7un9Mz3Gw":{"author1":"Boyce Myers","author2":"Reid Turner","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: Physician assisted death indicates the ability of a medical doctor to knowingly and intentionally provide a person with the knowledge or means required to initiate death.  This can include counselling about lethal doses of drugs, prescribing such lethal doses, or supplying the drugs necessary for death.  Physician assisted suicide and euthanasia are grouped under the umbrella of physician assisted dying.  PAS is at the request and consent of the patient, where the patient will self-administer the means of death.  In euthanasia, the doctor will administer the means of death. <h3>Section</h3> 2: To request a prescription for lethal medications, the Death with Dignity Act requires that a patient voluntarily express his wish to die and be:   an adult,   a South Carolina resident,   mentally capable, and   diagnosed with a terminal illness (incurable and irreversible) that will lead to death within twelve months. <h3>Section</h3> 3: Patients meeting these requirements are eligible to request a prescription for lethal medication from a licensed Oregon physician. To receive a prescription for lethal medication, the following steps must be fulfilled:   the patient must make two oral requests to his physician, separated by at least 15 days;   the patient must provide a written, witnessed request to his physician (two witnesses);   the prescribing physician and a consulting physician must confirm the diagnosis and prognosis;   the prescribing physician and a consulting physician must determine whether the patient is capable;   if either physician believes the patient's judgment is impaired by a psychiatric or psychological disorder, he must refer the patient for a psychological examination;   the prescribing physician must inform the patient of feasible alternatives to assisted suicide, including comfort care, hospice care, and pain control; and   the prescribing physician must request, but may not require, the patient to notify his next-of-kin of the prescription request. <h3>Section</h3> 4: An adult in the state of South Carolina will be referred to as anyone who is 18 years or older. <h3>Section</h3> 5:  \"Capable\" means that in the opinion of a court or in the opinion of the patient's attending physician or consulting physician, psychiatrist or psychologist, a patient has the ability to make and communicate health care decisions to health care providers, including communication through persons familiar with the patient's manner of communicating if those persons are available. <h3>Section</h3> 6:  Physicians and patients who follow the act's requirements are protected from criminal prosecution, and the choice of legal physician-assisted suicide cannot affect the status of a patient's health or life insurance policy. <h3>Section</h3> 7:  All laws or parts of laws in conflict with this bill are herewith repealed to the extent of the conflict. <h3>Section</h3> 8: If any portion of this act shall be declared unconstitutional, it is the intent of the Legislature that the other portions shall remain in full force and effect. <h3>Section</h3> 9: This bill will be implemented January 1, 2016","billTitle":"Death with Dignity Act: An act to legalize physician assisted dying","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsW4UoDY7un9Mz3Gw","rocketDocketStatus":"no","school":"Hammond School","sponsor":" "},"-K3JsWFJ7eKqWt2jINLh":{"author1":"Cle Pennington","author2":"Sumant Rao","authorLocation":"not yet assigned","billLocation":"F","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently in the state of South Carolina, the sixty judges that constitute the state Supreme Court, Court of Appeals, and Circuit Courts all are elected by the General Assembly, the state House of Representatives and the Senate. This is done through recommendation by the South Carolina Judicial Merit Selection Committee. In fact, other than Virginia, South Carolina is the only state to appoint judges based solely on legislative election, putting too much power in the legislature. Furthermore, of the 170 current members of the General Assembly, fifty, or around thirty percent, are active attorneys and thus argue cases in front of the justices that they chose to elect. This creates a political climate in which justices can become biased and thus make rulings not by evidence presented but by whichever legislator is arguing the case so that they will be reelected at the expiration of their term. <h3>Section</h3> 2: This bill will change the election of justices instead to slightly mirror the federal system to resolve the potential bias and imbalance within the current system. Thus, justices will be nominated by the acting Governor and subsequently approved by the South Carolina Judicial Merit Selection Committee. Then, the Governor's nomination will be confirmed by a simple majority vote in both the House of Representatives and the Senate. <h3>Section</h3> 3: Also, because this is simply a reform measure within the government to alleviate a corruption issue, there would be no need for funding or expenditure from the government. The reason we decided upon a simple majority instead of a two-thirds majority in the General Assembly is simply because a two-thirds majority is difficult to attain, which would still lead to justices having to appease legislators to get elected. With a simple majority, a consensus is more easily reached, alleviating justices with the pressure to appease certain legislators. Also, if the General Assembly rejects a judicial candidate, then that candidate is taken off of the ballot for the position since the Governor has no veto power in South Carolina, except for bills concerning budget. Thus, the legislature's decision is final. <h3>Section</h3> 4: As this bill is meant to curb judicial corruption, the bias and dependency of justices regarding specific legislators should decrease. However, the South Carolina Commission on Judicial Conduct is still responsible to seek out bias amongst justices, as it was designed to do, and administer punishment and trial as necessary. <h3>Section</h3> 5: When signed into law by the Honorable Youth Governor, this law will go into effect January 1, 2016.","billTitle":"An Act to Change the Nomination and Election of South Carolina Judges","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsWFJ7eKqWt2jINLh","rocketDocketStatus":"no","school":"Hammond School","sponsor":" "},"-K3JsWQ2vl5-OCVEx-HJ":{"author1":"Caroline Zeller","author2":"Colleen Goff","authorLocation":"not yet assigned","billLocation":"B","billStatus":"on the docket","billText":"<h3>Section</h3>1: Any person found to be wearing an obnoxious amount of perfume and/or cologne will be fined. <h3>Section</h3> 2: To ease the sufferings of people with asthma and/or allergies, to keep the air clean of toxins similar to non smoking laws. Also to improve the lives of citizens who are forced to inhale unwanted scents. <h3>Section</h3> 3: With this bill in effect any person found to be wearing an obnoxious amount of perfume and/or cologne will be fined 500 dollars for a first offense with an increase of 50 dollars for every following offense. We define an obnoxious amount of perfume and/or cologne to be a scent detectable from more than 5 feet away. Any retailer with the sale of perfume/cologne will not be allowed to advertise them through over use throughout the atmosphere of the store. Any person may report the crime and an officer of the law will handle the situation with the specifications previously stated. <h3>Section</h3> 4: People with health problems will no longer live in fear of an attack from these harmful airborne toxins. <h3>Section</h3> 5: When signed into law, the first increase will take place on January 1, 2016.","billTitle":"An Act to criminalize the overuse of perfume/cologne in public places","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsWQ2vl5-OCVEx-HJ","rocketDocketStatus":"no","school":"Wade Hampton High School","sponsor":" "},"-K3JsWaJS7IkvUI0m5f2":{"author1":"Hunter Corrin","author2":"Sydney Hyer","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently in South Carolina, there is no restriction to who can pump gas into a vehicle. This bill would make it illegal for a citizen to operate a \"Class C\" flammable liquid dispenser. <h3>Section</h3> 2: It would be the responsibility of the owner of the service station to hire attendants that would take on the job in order to bring the station to a \"full service\" level. <h3>Section</h3> 3: The benefits of this act include:   Increased safety around the hazardous liquid   Thousands of jobs created   In states where this is already enacted, New Jersey and Oregon, gas prices are significantly lower than neighboring states. <h3>Section</h3> 4: When signed into law, it would be under the authority of the owner of the gas station to hire the attendants by January 1st, 2015. If they fail to do so or allow customers to pump their own gas they would be subject to fines between $50 and $250.","billTitle":"An Act to Require Gas Station Attendants","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsWaJS7IkvUI0m5f2","rocketDocketStatus":"no","school":"St. Josephs Catholic School","sponsor":"Sarah Maunsell"},"-K3JsWmZ63TR4ERtcd3x":{"author1":"Nathan Petrofes","author2":"Walker Seman","authorLocation":"not yet assigned","billLocation":"D","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently in South Carolina the winner of the popular vote in the presidential election receives all of South Carolinas electoral votes (9). <h3>Section</h3> 2: This bill would give two of South Carolinas electoral votes to the popular vote winner, leaving the rest to be decided by the popular vote in each congressional district (7). <h3>Section</h3> 3: With this bill in effect, South Carolina could have its electoral votes split, allowing for a more fair representation of the state. <h3>Section</h3> 4: When signed into law, this bill would take effect during the presidential election of 2016.","billTitle":"An Act to Modify the Electoral College of South Carolina","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsWmZ63TR4ERtcd3x","rocketDocketStatus":"no","school":"St. Josephs Catholic School","sponsor":"Dan Viedeman"},"-K3JsWxTBu6vX6aIibCY":{"author1":"Dean Lage","author2":"Manu Budidi","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: Appropriation of 5% of South Carolinas SLED funding dedicated solely to the tracking and preventing of crimes via deep web activities. (Human/drug trafficking, arms trading, etc.) <h3>Section</h3> 2: This bill would be implemented at the beginning of the next state fiscal cycle when the state legislature approves a new budget making sure that 5% of SLEDs cyber budget is dedicated to deep web crime prevention. Also, this bill would not cost any more money to the taxpayers as all this bill does is reapropriate funds. <h3>Section</h3> 3: On deep web servers, online activity is impossible to track therefore making this corner of the internet a safe haven for criminals. Sites like Silk Road use virtual currency called Bitcoin to pay for often illegal services such as drug smuggling, human trafficking, contract killings, and illegal arms dealing. In the state of South Carolina, its been estimated by SLED (State Law Enforcement Division) that while only 20% of all drugs are shipped via deep web transactions, they account for 43% of all drug trafficking profits. Because the deep web is such a safe effective place to sell illegal products, criminals are flocking to it in droves. <h3>Section</h3> 4: If implemented, this bill would:   decrease drug crime via undercover online investigations   reduce presence of online drug rings such as Silk Road in the state of South Carolina   decrease violent crime by breaking up anonymous illegal weapons deals   stop the use of the deep web to further criminal operations in South Carolina <h3>Section</h3> 5: When signed into law, this bill will go into effect on January 1st, 2016.","billTitle":"An Act to Appropriate Funds for Deep Web Crime Prevention","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsWxTBu6vX6aIibCY","rocketDocketStatus":"no","school":"Riverside High School","sponsor":"Unshu Biyani"},"-K3JsX7RbZ61ekLxEYBS":{"author1":"Ladson Ellis","author2":"Thomas Gasque","authorLocation":"not yet assigned","billLocation":"F","billStatus":"on the docket","billText":"<h3>Section</h3>1: A plan will be made to secede from the Union if real estate developer and reality TV star Donald John Trump is elected president of the United States in 2016. <h3>Section</h3> 2: South Carolina will declare its independence from the United States of America, and create its own government, largely based upon the existing one of the US, with a president and a congress forming out of the already existing state government. <h3>Section</h3> 3: South Carolina will have its own independent economy, with its own taxes. South Carolina has been one of the few states to consistently balance its budget every year for the last two decades. The South Carolina economy will be better off without the United States bringing it down. <h3>Section</h3> 4: South Carolina will no longer be associated with US actions such as:   Military action (including war)   Taxation   Alliances and Treaties <h3>Section</h3> 5: South Carolina will continue to use the dollar as currency, independent from the US dollar. There will be an exchange rate for the US dollar and the South Carolina dollar, just as there is for all other currency. The South Carolina dollar will look different and have a different value. <h3>Section</h3> 6: If necessary, actions to secede will begin on November 9, 2016, the day after the 2016 election.","billTitle":"An Act to Secede From the Union if Donald Trump is Elected President","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsX7RbZ61ekLxEYBS","rocketDocketStatus":"no","school":"Shannon Forest Christian School","sponsor":" "},"-K3JsXVQhuKQWqf5iHoQ":{"author1":"Wilson Carlisle Smith","author2":"Sarah Ann Christenbury","authorLocation":"not yet assigned","billLocation":"B","billStatus":"on the docket","billText":"<h3>Section</h3>1:   Currently in the state of SC, when a student in public schools enters 5th grade, they attend a seminar of the development of their body. Over the rest of the time that they are in high school, they progressively learn more about sexual education. However, there is no program that teaches awareness of domestic and sexual abuse. <h3>Section</h3> 2: Our bill would introduce a program that teaches the youth in public schools about domestic and sexual abuse. The program starts in fifth grade and is taught in conjunction with the curriculum of fifth grade level sex education. As the details of sex education increase, so will details on domestic and sexual education.  For example, at fifth grade level, body awareness and creating a safe environment for communicating concerns at home. <h3>Section</h3> 3: Sexual Education is a program that is taught through the Physical education and Health classes in public schools.  The teachers of this sexual education curriculum would teach the Domestic and Sexual Abuse curriculum as well, therefore, no additional faculty would need to be hired. State Educational Budget would fund the development of the curriculum, and a revisal update every 7 years. <h3>Section</h3> 4: Once the curriculum is developed and approved by the Superintendent of Education, this program would go into affect the beginning of the following school year.","billTitle":"An Act to Create a Safe Environment for the Discussion of Domestic and Sexual Abuse","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsXVQhuKQWqf5iHoQ","rocketDocketStatus":"no","school":"Greenville High School","sponsor":" "},"-K3JsXf5dTFcx2GtapVc":{"author1":"Nicole Dennis","author2":"Melvin Matute","authorLocation":"not yet assigned","billLocation":"C","billStatus":"on the docket","billText":"<h3>Section</h3>1: A teacher, administrator, or staff personnel in the state of South Carolina can be hired without any certification in the use of a defibrillator. <h3>Section</h3> 2: School personnel will be required to take a 3 hour CPR AED course to become trained and certified. <h3>Section</h3> 3: School personnel should be required to be CPR AED certified prior to their hiring process. Currently more than 30 high school students have passed due to sudden heart failure. <h3>Section</h3> 4:   With school personnel being trained and certified with the use of a defibrillator it will:   Increase knowledge with emergency situations.    Create safeguarded environments for students, school personnel and parents, alike.   Decrease amount of fatalities among high school students. <h3>Section</h3> 5: When signed into law, the State will be required to train and certify all school personal in the use of defibrillators on December 1st, 2015.","billTitle":"An Act that requires all school personnel to be trained and certified in the use of defibrillator.","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsXf5dTFcx2GtapVc","rocketDocketStatus":"no","school":"Legacy Charter High School","sponsor":" "},"-K3JsXprqJ0fpRWOPJyg":{"author1":"Lila Weston","author2":"Nan Wilson","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: Our bill is put in place to encourage South Carolinas youth to have knowledge on common household practices. Meals: how to cook a nutritional, reasonably priced meal as opposed to spending money on unhealthy fast food; Cleaning: how to maintain a household and change sheets, wash dishes, wash clothes, change diapers, etc.; everyday knowledge: change tires, balance checkbook, pay taxes, jump a car, handle children, CPR, etc. <h3>Section</h3> 2: Along with being required to take courses such as Physical Education, teens in America should be required to complete at least one semester of Home Economics for basic knowledge on cooking, cleaning, and other daily needs that is vital to life. <h3>Section</h3> 3: South Carolina graduation requirements state that every high school student needs 7.0 elective credits to graduate. This course would only take up .5 of those electives and could technically be optional due to the fact that it would be considered an elective and most schools have a wide variety of them to chose from. This would at least give students an opportunity to attain these basic skills that our bill is advocating. Some kids have parents who work late shifts and do not get home in time to cook dinner. With this course they would know how to make a healthy meal that is a good price. Also, when kids go to college they would now have the knowledge of nutritional values of different food so they could make healthier decisions on their diets. This course would also provide young South Carolinians with the knowledge of changing tires, cleaning.","billTitle":"An Act to Require High School Students to Take a Semester of Family and Consumer Science","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsXprqJ0fpRWOPJyg","rocketDocketStatus":"no","school":"Christ Church Episcopal School","sponsor":" "},"-K3JsY-sJUpNw8ICU57i":{"author1":"Zachary Kennemore","author2":"Bowen Tiller","authorLocation":"not yet assigned","billLocation":"A","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, it is illegal for any person to engage in any from of prostitution or run any sort of brothel. The purpose of this bill is to legalize prostitution in a licensed brothel. <h3>Section</h3> 2: Once legalized, prostitution (defined as the practice of engaging in sexual activity with someone[s] for payment) will be legal in licensed brothels (to be defined as a place of business where prostitutes partake in sex work that has passed to the proper requirements). <h3>Section</h3> 3: To obtain a license, a brothel must submit an application fee of 10,000 dollars and fill out the application which will be authored by the county district attorney. The Brothel will also have to pass a yearly fire marshal inspection and pass a health inspector's inspection both of which the brothel is expected to pay for. If a brothel fails an inspection, the license will be voided. <h3>Section</h3> 4: To obtain a prostitution license a application fee of 1,000 dollars and a completed application (authored by the county district attorney). <h3>Section</h3> 5: Licenses for a prostitute are only usable in the county that accessed the license.  The prostitute can apply for licenses in other counties. <h3>Section</h3> 6: Prostitutes are required to be tested to weekly for STDs. The test is mandatory and if the test does not show that the prostitute is disease free, the license for said prostitute will be suspended. <h3>Section</h3> 7: This law does not protect prostitutes who engage in the act of prostitution outside of a licensed brothel and the standard repercussions are enforced. <h3>Section</h3> 8: Prostitutes and brothels are expected to pay average taxes and the person paying for the service will pay a 5% tax on the service. The tax revenue from this will go to the fund to maintain public roads and government buildings. <h3>Section</h3> 9: If signed, this bill will become effective on January 1, 2017.","billTitle":"An Act to Legalize The Act of Male And Female Prostitution in Licensed Brothels in South Carolina","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsY-sJUpNw8ICU57i","rocketDocketStatus":"no","school":"Clinton High School","sponsor":" "},"-K3JsYA_b-nlmsKehExW":{"author1":"Reagan Hack","author2":"Caroline Evatt","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: Domestic animals include livestock; other animals that through long association with humans have been bred to a degree resulting in genetic changes affecting the temperament, color, conformation, or other attributes of the species to an extent that distinguishes them from non-domestic animals of their kinds; and other animals as defined by rule by the director. <h3>Section</h3> 2:  Animal cruelty and neglect is any crime of inflicting physical pain, suffering, or death on an animal, beyond necessity for normal discipline (also includes withholding of food, water, proper shelter, and attention). <h3>Section</h3> 3:  Animal ownership is defined as the legal possession of an animal that has been tamed and kept by humans as a work animal, food source, or pet, especially a member of those species that have, through selective breeding, become notably different from their wild ancestors. <h3>Section</h3> 4:  No person shall, after previously being convicted of any count of animal cruelty or neglect charges, own another domestic animal for any reason in the state of South Carolina. <h3>Section</h3> 5: Anyone that shall violate this act shall be charged with a misdemeanor of the first degree for the first offense, and shall pay a fine of up to $1,000 and serve up to 90 days in jail. This fine shall be used to pay for court costs and for random checks conducted on the household by a representative of a local animal shelter in the local area. The person convicted shall also, on top of necessary fees, pay for any medical bills of all abused animals in his ownership and must register with an internet database identifying himself as having been charged with animal abuse in his local area. <h3>Section</h3> 6: When signed into law, this bill shall take effect 180 days after passage.","billTitle":"An Act to Outlaw the Ownership of a Domestic Animal After Previous Charges of Animal Cruelty and/or Neglect","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsYA_b-nlmsKehExW","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3JsYLlhGQEtv0BmfCp":{"author1":"Kalyn Miles","author2":"Kenneth Giraldo","authorLocation":"not yet assigned","billLocation":"F","billStatus":"on the docket","billText":"<h3>Section</h3>1: Our current energy sources are pollutive, nonrenewable, and expensive. Fossil fuels such as coal, oil, etc. harm our atmosphere, of which we breath and protect us from excess solar radiation. The current property tax for corporations and businesses is currently 10.5%, but when companies use eco-friendly alternative energy sources the tax will be reduced to 8.5%. The 2% will be accounted for by increasing the tobacco sales tax. <h3>Section</h3> 2:  The tobacco sales tax will be adjusted to meet the differences thus when the alternative energy companies relocate to South Carolina within a month of residency, the property tax will be decreased to 8.5%. <h3>Section</h3> 3:  Companies would have to meet the qualifications of alternative energy to be allowed the tax break. Members of the South Carolina Department of Health and Environment Control will decided which companies are qualified to receive the tax break. <h3>Section</h3> 4:  Qualifications for the tax breaks are as follows.   Must be eco-friendly, not harming the environment.    Renewable energy source   Cheaper source of energy to manufacture (hydropower, wind power, solar power). <h3>Section</h3> 5: Revenue from this will be slow, but an investment into the future of a cleaner, healthier South Carolina. With an increase of sales taxes on tobacco, there may be a decrease in sales and fewer fumes in the air. <h3>Section</h3> 6: When signed into law, the tax break will take place on January 1, 2016.","billTitle":"An Act to Create Eco-Friendly Energy","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsYLlhGQEtv0BmfCp","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3JsYWsWUUEn1591co7":{"author1":"Anna Shaw","author2":"Abbey Shaw","authorLocation":"not yet assigned","billLocation":"A","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently in South Carolina for a student to graduate high school they must have successfully completed a half unit of keyboarding. <h3>Section</h3> 2:  Most students do not take keyboarding until they are in middle school and we believe that students should learn how to type and navigate computers at a much earlier age. <h3>Section</h3> 3:  Our world is currently centered around technology, therefore students should have access to attend a class in elementary school to better prepare them on how to quickly navigate their computers. <h3>Section</h3> 4:  This law would improve students ability to complete class projects, essays, and better understanding of computers and how to type. <h3>Section</h3> 5: The law would require students in fourth and fifth grade to begin taking keyboarding classes, to improve their typing abilities. <h3>Section</h3> 6: When signed into law, this bill will take effect in the August 2016 school year.","billTitle":"An Act to Add Keyboarding to Elementary School Requirements","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsYWsWUUEn1591co7","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3JsYhoYIvtAkMJYyrI":{"author1":"Kayleigh Pitts","author2":"Molly Scarborough","authorLocation":"not yet assigned","billLocation":"E","billStatus":"on the docket","billText":"<h3>Section</h3>1: Abortion is defined in South Carolina Code Title 44: Health, Chapter 41: Abortions, as: Using an instrument or medication with the intent to terminate a pregnancy. <h3>Section</h3> 2: Abortion is legal in the state of South Carolina under the following three circumstances:   The first trimester with the womans consent.   In the second trimester with the pregnant womans consent in a certified hospital or clinic.   In the third trimester when necessary to preserve the life or health of the pregnant woman on the written recommendation of two doctors, and if the basis is mental health then two doctors as well as a consulting psychiatrist must agree in writing that the abortion is necessary. <h3>Section</h3> 3: The just-conceived prenatal life form is referred to by physicians as a zygote. From five to twelve days post-conception the zygote forms into a blastocyst. The blastocyst attaches to the lining of the uterus, and from day twelve through week six, the being is termed an embryo. According to the American Pregnancy Association, everything that is present in an adult human is now present in the small embryo. From week seven until birth, the embryo is named a fetus. <h3>Section</h3> 4: This Bill shall go into effect on January 1,2016 upon the signature of the Youth Governor of the State of South Carolina.","billTitle":"For an Act amending the law of abortion, of the state of South Carolina, relating to making abortion illegal after the first trimester.","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsYhoYIvtAkMJYyrI","rocketDocketStatus":"no","school":"Clinton High School","sponsor":" "},"-K3JsYto8xAJMgjTlrMG":{"author1":"Liam Barr","author2":"Olivia Thurmond","authorLocation":"not yet assigned","billLocation":"F","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently the prerequisites needed to vote in the state of South Carolina are as follows:   You must be a citizen of the United States.   You must be 18 years old or older on Election Day.   You must be a resident of the precinct in which you register to vote.   You must be mentally competent.   You cannot be confined in any public prison, convicted of committing a crime.   If you have been convicted of a felony, or an offense against election laws, you must have served your entire sentence (including probation or parole), or you must be pardoned before you can vote again <h3>Section</h3> 2:  The state of South Carolina would expand voting rights to individuals with cognitive disabilities in state elections. This act would ask voters to take a short, opt in questionnaire in order to determine their expertise on South Carolinas political system and basic current issues. The weight of an individual's vote is determined by how he or she does on the questionnaire. <h3>Section</h3> 3:  The results of the questionnaire would cause a South Carolina citizens vote to count either one, two, or three times based on their success on the questionnaire. Votes of individuals who decide not to take the questionnaire will be weighted as one vote. <h3>Section</h3> 4:  The questionnaire would be approved by the Governor as well as State Congress and will be taken when individuals vote for state and local elections. <h3>Section</h3> 5:  When signed into law, the first questionnaire will be required to vote in 2016 elections.","billTitle":"An Act to Increase Voting Rights   BE IT HEREBY ENACTED BY THE YMCA MODEL LEGISLATUREOF SOUTH CAROLINA   Section 1: Currently the prerequisites needed to vote in the state of South Carolina are as follows:   You must be a citizen of the United States.   You must be 18 years old or older on Election Day.   You must be a resident of the precinct in which you register to vote.   You must be mentally competent.   You cannot be confined in any public prison, convicted of committing a crime.   If you have been convicted of a felony, or an offense against election laws, you must have served your entire sentence (including probation or parole), or you must be pardoned before you can vote again Section 2:  The state of South Carolina would expand voting rights to individuals with cognitive disabilities in state elections. This act would ask voters to take a short, opt in questionnaire in order to determine their expertise on South Carolinas political system and basic current issues. The weight of an individual's vote is determined by how he or she does on the questionnaire.    Section 3:  The results of the questionnaire would cause a South Carolina citizens vote to count either one, two, or three times based on their success on the questionnaire. Votes of individuals who decide not to take the questionnaire will be weighted as one vote.   Section 4:  The questionnaire would be approved by the Governor as well as State Congress and will be taken when individuals vote for state and local elections.   Section 5:  When signed into law, the first questionnaire will be required to vote in 2016 elections.","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3JsYto8xAJMgjTlrMG","rocketDocketStatus":"no","school":"Christ Church Episcopal School","sponsor":" "},"-K3Jzpu-glf2nJ6nuk-Z":{"author1":"Anna Stone","author2":"Lara Dym","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: Selfies will be outlawed in all public places. <h3>Section</h3> 2: If a selfie is taken in a public place, there will be a fine of $25 if no harm is done. <h3>Section</h3> 3: If damages result from the taking of a selfie, the offender will be responsible for all damages incurred. <h3>Section</h3> 4: This law against taking selfies in public places will take place on January 1st, 2016 following its passage into law.","billTitle":"An Act to Ban Taking and Posting Selfies in Public Places","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3Jzpu-glf2nJ6nuk-Z","rocketDocketStatus":"no","school":"Spartanburg Day School","sponsor":"Kathleen Babb and Lauren Oakes"},"-K3K-ndDvn0jwdnxAR5l":{"author1":"Lily Webster","author2":"Hayden Genoble","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Any inmate serving a life sentence with no hope of parole will be allowed to opt for physician-assisted suicide. <h3>Section</h3> 2: The inmates life will be ended with a large dose of Secobarbital <h3>Section</h3> 3: An inmate must wait 3 years from sentencing before they are allowed to opt for physician-assisted suicide. <h3>Section</h3> 4: To qualify the person must have a psychological evaluation to check for the ability to make decisions and to make sure the inmate is in their right state of mind. <h3>Section</h3> 5: When signed into law, the first option for physician-assisted suicide will take place on January 1st, 2016.","billTitle":"Allowing the option of physician-assisted suicide in the form of a pill for recipients of life sentence in prison who have no chance of parole.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K-ndDvn0jwdnxAR5l","rocketDocketStatus":"no","school":"Spartanburg Day School","sponsor":"Cooper Hannah and Zion Williamson"},"-K3K02ead4JuvnLVbHUr":{"author1":"Lily Webster","author2":"Hayden Genoble","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Any inmate serving a life sentence with no hope of parole will be allowed to opt for physician-assisted suicide. <h3>Section</h3> 2: The inmates life will be ended with a large dose of Secobarbital <h3>Section</h3> 3: An inmate must wait 3 years from sentencing before they are allowed to opt for physician-assisted suicide. <h3>Section</h3> 4: To qualify the person must have a psychological evaluation to check for the ability to make decisions and to make sure the inmate is in their right state of mind. <h3>Section</h3> 5: When signed into law, the first option for physician-assisted suicide will take place on January 1st, 2016.","billTitle":"Allowing the option of physician-assisted suicide in the form of a pill for recipients of life sentence in prison who have no chance of parole.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K02ead4JuvnLVbHUr","rocketDocketStatus":"no","school":"Spartanburg Day School","sponsor":"Cooper Hannah and Zion Williamson"},"-K3K07uUbwZP9qMSc6sm":{"author1":"Taylor Birch","author2":"Allie Lockman","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: To date, Guantanamo Bay has held 780 detainees since 2002. 64 of the 116 that remain are deemed to be some of the most dangerous international terrorists known at this time, and therefore are not foreseen to ever be released. President Obama has requested to close Guantanamo Bay prison, and transfer the detainees to United States soil to reduce the defense budget. The state of South Carolina must not be an option for the relocation and housing of the remaining detainees. <h3>Section</h3> 2: By January 1, 2016 the former U.S. naval base, located in Charleston, South Carolina, must not be considered a sufficient relocation option due to many factors notwithstanding safety and security concerns within the community of Charleston as well as the state as a whole. <h3>Section</h3> 3: Knowing it may be more costly to keep the detainees in Guantanamo Bay, the priority of our government should be to protect its citizens. Therefore, the detainees should remain in their current, remote location. <h3>Section</h3> 4: Not authorizing the transfer of these detainees to South Carolina would:   Protect the safety and well-being of all current and future South Carolina citizens;   Prevent negative financial obligations that would be burdensome on the state of South Carolina;   Prevent South Carolina from being a future dumping ground for international detainees.","billTitle":"An Act to prevent the Guantanamo Detainees from being moved to South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K07uUbwZP9qMSc6sm","rocketDocketStatus":"no","school":"Spartanburg Day School","sponsor":"Jake Popkin and Sam Freedman"},"-K3K0Qm6dnj8r_SynkfT":{"author1":"Taylor Birch","author2":"Allie Lockman","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: To date, Guantanamo Bay has held 780 detainees since 2002. 64 of the 116 that remain are deemed to be some of the most dangerous international terrorists known at this time, and therefore are not foreseen to ever be released. President Obama has requested to close Guantanamo Bay prison, and transfer the detainees to United States soil to reduce the defense budget. The state of South Carolina must not be an option for the relocation and housing of the remaining detainees. <h3>Section</h3> 2: By January 1, 2016 the former U.S. naval base, located in Charleston, South Carolina, must not be considered a sufficient relocation option due to many factors notwithstanding safety and security concerns within the community of Charleston as well as the state as a whole. <h3>Section</h3> 3: Knowing it may be more costly to keep the detainees in Guantanamo Bay, the priority of our government should be to protect its citizens. Therefore, the detainees should remain in their current, remote location. <h3>Section</h3> 4: Not authorizing the transfer of these detainees to South Carolina would:   Protect the safety and well-being of all current and future South Carolina citizens;   Prevent negative financial obligations that would be burdensome on the state of South Carolina;   Prevent South Carolina from being a future dumping ground for international detainees.","billTitle":"An Act to prevent the Guantanamo Detainees from being moved to South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0Qm6dnj8r_SynkfT","rocketDocketStatus":"no","school":"Spartanburg Day School","sponsor":"Jake Popkin and Sam Freedman"},"-K3K0SYEbfdZ-TQxw9OB":{"author1":"Rachel Castellani","author2":"Andre De Castro","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1:  There are no current limitations concerning the prices for necessary  pharmaceuticals, an act like this would make it so that any pharmaceutical which  makes over a certain threshold in revenue needs to be evaluated by an established  committee to determine the maximum price on life saving drugs. <h3>Section</h3> 2: Limiting the maximum price of life saving pharmaceuticals will prevent a  drastic increase of pharmaceutical prices. This price cap will ensure a just  pharmaceutical price for those economically vulnerable. <h3>Section</h3> 3: Because the market for over-the-counter drugs is very large, and the  supply for said drugs meets the demand, there are not many pricing issues, therefore,  over-the-counter drugs, and medicine not related directly to health, are exempt. <h3>Section</h3> 4: Potential gain from this bill:   Affordable prescription drugs;   Decrease in people trying to make money off of drugs that could be sold for less. <h3>Section</h3> 5: When signed into law, the first pharmaceutical evaluation will take place on January 1, 2016.","billTitle":"An Act Concerning Maximum Price for Necessary Pharmaceuticals","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0SYEbfdZ-TQxw9OB","rocketDocketStatus":"no","school":"Southside Christian School","sponsor":"Selik Hopper and Maddie Stringer"},"-K3K0Tjj9HfrP4EFZg20":{"author1":"Keylee King","author2":"Emme Bagwell","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1:   Currently, there is no required screening for mental health for high school  students in South Carolina. <h3>Section</h3> 2: This bill will not require extensive funding due to the fact that the screening  will be an online survey created by the American Mental Health Counselors Association;  the screening will be conducted in each social studies or science class in the first week  of school. <h3>Section</h3> 3:  The 12th graders will take the screening test on the first day of school, the  11th graders will take the screening test on the second day of school, the 10th graders  will take the screening test on the third day of school, and the 9th graders will take the  screening test on the fourth day of school. <h3>Section</h3> 4: This bill will help reduce teen suicides and school shootings by raising  awareness for mental illnesses, specifically depression, anxiety, and ADHD. <h3>Section</h3> 5: Mental health screenings will be required at the beginning of each school  year starting in the school year of 2018-2019","billTitle":"An Act to Promote Mental Health Awareness","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0Tjj9HfrP4EFZg20","rocketDocketStatus":"no","school":"Riverside High School","sponsor":"Briana Marler and Samantha Stocking"},"-K3K0V6n_nCLUyFuBPhP":{"author1":"Campbell Mitchell","author2":"Sullivan Corley","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently grades 9th-12th are required by state laws to learn certain curriculum that prepares them for college. These include a form of English, History, Math, Science, and a language chosen by the student. <h3>Section</h3> 2:  By January 19, 2016, students in 11th and 12th grade will have the option to choose their own curriculum giving them the ability to take classes they need in the field of their choice, based on what career they would like to pursue. <h3>Section</h3> 3:  Cutting the unnecessary courses will allow more time to prepare students for the career they would like to pursue. This option is open to all 11th and 12th grade students who have a certain career that they would like to follow. It will also make a big impact on their college choices depending on the career they choose. <h3>Section</h3> 4:  This law would cause:   Unemployment rates to decrease, because students would be more assured of a job or career.   Getting rid of unnecessary courses to help more students be well-rounded while also having more time for extra-curricular activities.   Students to have an extra two years of experience towards college and their future careers. <h3>Section</h3> 5:  When signed into law, this option will be available beginning January 1Clear formatting and concise descriptions make for better debate and clearer                understanding! Clear formatting and concise descriptions make for better debate and clearer                understanding!","billTitle":"An Act to Better Prepare Students for Their Future","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0V6n_nCLUyFuBPhP","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K0VyhsVH8XoOzi_2x":{"author1":"Jessica Beard","author2":"Dylan Grubbs","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: Increased investment in the fine arts branch of the school system will lead to a level higher f academic learning and understanding of the world around us.  Higher levels of academic understanding leads to an increase in the economic income of the effected home. <h3>Section</h3> 2: Give a grant to the fine arts departments <h3>Section</h3> 3: Limit of grants total for the year allowed is $1 billion through tax dollars. School districts will receive amounts based on the population of their school district.  Title 1 schools will be given an additional 15% in addition to their total population. <h3>Section</h3> 4: State, school districts nor school many decide how the money is spent.  Money is spent as the art department sees fit. <h3>Section</h3> 5: This bill will go into effect at the beginning of next school year.","billTitle":"Burns Art Act","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0VyhsVH8XoOzi_2x","rocketDocketStatus":"no","school":"Hillcrest High School","sponsor":"Greene and Eich"},"-K3K0We7cVEBCIqwAkk0":{"author1":"Anthony Furino","author2":"Abigail Burton","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: There are currently no traffic cameras in the state so if this law is passed we will be putting in speeding cameras, and traffic light cameras all over the state. <h3>Section</h3> 2: We will begin by adding cameras to the most populated and congested areas around the state then adding cameras to less congested areas. <h3>Section</h3> 3: We will pay for this by adding a $0.02 per dollar sales tax on all non-edible food products, and a $0.05 per dollar sales tax on gasoline sales. <h3>Section</h3> 4: This will allow officers to work on more serious crimes, and the traffic cameras would be used for the minor traffic offenses like: Running a red light, speeding in access of 10 miles over the posted speed limit and other low risk offenses. <h3>Section</h3> 5: This pass will allow:   Officers to not have to do minor traffic offenses   Accurate and non-negotiable ticketing   Safer streets for our families, and friends <h3>Section</h3> 6: When signed into law the tax and work will take effect on January 1st, 2016.","billTitle":"An act to add Traffic Cameras","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0We7cVEBCIqwAkk0","rocketDocketStatus":"no","school":"Hillcrest High School","sponsor":"Klenotiz and Sorrow"},"-K3K0nKQ_XRocjQwi_zS":{"author1":"Hannah Burns","author2":"Avery McMurtry","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: The purpose of this class would be to create students who are interested in  what is going on in the world around them, and who use their knowledge to benefit the  community. <h3>Section</h3> 2: This class would be an optional elective in public high schools of South  Carolina. It would be available to grades 9-12 and would provide a student with a half  credit upon passing the course. <h3>Section</h3> 3: The curriculum includes: discussing events as a class, holding debates,  brainstorming solutions, interpreting political cartoons, summarizing articles,  connecting the present to the past, and looking at causes and effects. <h3>Section</h3> 4: When signed into law, this would be enacted for the 2016-2017 school year.","billTitle":"An Act to Instate a Current Event Class in Public Schools","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0nKQ_XRocjQwi_zS","rocketDocketStatus":"no","school":"Bishop England High School","sponsor":"Makena Roe and Justin Lively"},"-K3K0p6e2Z0eyQa3OWZd":{"author1":"Aidan Worthington","author2":"Andrew Robertson","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current funding for people who rely food support programs like SNAP (supplemental nutrition assistance program) in South Carolina well below the national standard. This bill would increase this funding by 20% over 5 years <h3>Section</h3> 2: People who are unemployed who qualified i.e. those below the poverty line and unemployed would be given this benefit. Each participant would be given a 4% increase to their average food allowance given by the government each year for 5 years. If the recipient is unable to get a job because of a disability or status, they will be given a 6% raise. <h3>Section</h3> 3:  Because working status directly affects income, and income affects budget for food jobs would be given by the state to people who rely on these kinds of benefits as a new start <h3>Section</h3> 4: This would effect:   The amount of time people focus on their job not their next meal   The productiveness of people at work    Job status in South Carolina   The productiveness of children in these poorer families at school <h3>Section</h3> 5: When written into law the first increase in funding for food programs would be on January 1, 2016","billTitle":"A Bill to Increase Spending on Food Supplies for Poorer Families and Motivate Workforce","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0p6e2Z0eyQa3OWZd","rocketDocketStatus":"no","school":"Porter Gaud School","sponsor":"Mary Gaillard"},"-K3K0qZf31Bc9S1K6fiF":{"author1":"Avery Morse","author2":"Savannah Carlton","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: The out-of-school tutoring fee, on average, costs between $10-15. In-school tutoring is free, but only offered by some teachers or by peer-tutors. <h3>Section</h3> 2:  If this bill is passed, free tutoring will be offered at least once a week by core class teachers. These teachers would be compensated for their extra time. <h3>Section</h3> 3:  This bill would give all students equal access to extra help. Having teachers offer free tutoring gives everyone opportunity to have a one-on-one experience to be more involved in their education and learning experience. This also allows for students to be taught by their own teachers, instead of classmates. <h3>Section</h3> 4:  Free mandatory tutoring would    Raise passing rates in classes   Allow for teachers to understand what the class, as a whole, is struggling with   Help eliminate economic disparity in student access to help in class <h3>Section</h3> 5: When signed into law, free tutoring would be available beginning with the 2016-2017 school year.","billTitle":"An Act for Mandatory Tutoring by Teachers","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0qZf31Bc9S1K6fiF","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K0sIz5FCPBnQ12VYx":{"author1":"L","author2":"ry Davis","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: The SBTBA shall grant tax breaks for existing and newly formed small businesses for a period of five (5) years. A small business shall be defined as any business licensed under South Carolina law that has, or will obtain, a maximum of fifteen (15) employees and generates, or anticipates generating, a gross revenue of five hundred thousand dollars ($500,000.00) or less in the period of one year. <h3>Section</h3> 2:  The purpose of this bill is to encourage the formation of small businesses, the hiring of new employees for newly formed small businesses, and to promote the hiring of additional employees for existing small businesses. <h3>Section</h3> 3:  The businesses eligible for the tax breaks are: Any newly formed small business or any existing small business licensed to do business under South Carolina law. <h3>Section</h3> 4:  Small Business owners shall be exempt from paying their newly hired employees payroll taxes for the first five (5) years of the employees employment with the small business. <h3>Section</h3> 5: Newly formed small businesses must start the five (5) years of tax breaks in the first year the small business opens. Existing small businesses may elect to take the tax break in the same year they hire new employees. Tax breaks cannot be saved to be used at a later date. <h3>Section</h3> 6: The business owner or their tax preparer will complete and file the business tax return on time or that business will not receive a tax break for that year and will be responsible for paying any employees payroll taxes that were not paid during the year. <h3>Section</h3> 7: The South Carolina Department of Revenue will keep track of the businesses tax breaks based on its yearly tax return. <h3>Section</h3> 8: When signed into law, this act shall go into effect January 1, 2016.","billTitle":"An Act Relating To Small Business Tax Breaks In South Carolina or the SBTBA","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0sIz5FCPBnQ12VYx","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K0tPM-HsRwDkn0Jgi":{"author1":"Nath Kapoor","author2":"Salem Rajaee","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Both corporations and small business owners would have the right to exclude or deny  included but not limited to  workers, products, customers, and taxes because of moral, religious, and personal beliefs or business and economic struggles. <h3>Section</h3> 2:  Business owners will have the right to do any of the above (with evidence, proof, or reason) without being subject to legal action (such as financial penalties, lawsuits, etc.), giving them opportunities to grow their business in an environment more suited to their belief and opinions. <h3>Section</h3> 3:  Customers, suppliers, and employers will not have the right to object to the business owners denial because of his or her beliefs. However, this bill will not support business owners if issues include denial because of rumors or false accusations. <h3>Section</h3> 4:  Passage of this bill would:   Allow business owners to manage their company in a more personalized, comfortable environment.   Let local and large businesses soar in growth because of environmental and legal factors that were never challenged or questioned before, thus raising productivity levels and large-to-small scale economy. <h3>Section</h3> 5: When signed into law, this bill will go into effect on January 1, 2016.","billTitle":"An Act to Give Business Owners Choice without being Legally Condemned","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0tPM-HsRwDkn0Jgi","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K0ut0QWGJirllyO5h":{"author1":"Carson Allender","author2":"Lynn Marie Tompkins","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current Advanced Placement (AP) classes would be removed from course options in High School. <h3>Section</h3> 2:  When these selected classes are removed from high schools, students will have an equal changes of acceptance into colleges because colleges will be forced to look closer at SAT and ACT scores rather than the level of courses taken. <h3>Section</h3> 3:  This bill will promote equality throughout schools. Students who thought they may never have been accepted into college will have a greater chance now because of this bill. We want this bill to pass so everyone not taking AP classes already can be more confident when applying to prestigious colleges. <h3>Section</h3> 4:  Passage of this bill will benefit:    Lower class students who dont have the same opportunities as middle and upper class students to take Advanced Placement courses   Student equality because students would be on equal educational grounds regarding GPA because Advanced Placement class would no longer inflate GPA    Students applying for college because GPA would measure students equally and colleges would look closer at SAT and ACT scores. <h3>Section</h3> 5: When signed into law, Advanced Placement Classes will be removed from high schools beginning in the 2016-2017 school year.","billTitle":"An Act to Take Advanced Placement Class Options out of High School","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0ut0QWGJirllyO5h","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K0vuarB0IIQ8ydWBb":{"author1":"Olivia Treanor","author2":"McKenna Roth","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: Many students in South Carolina are required to pay an application fee to apply to public colleges within the state. By the time students have applied to at least four to six public colleges they have paid at least three hundred dollars. The high cost may be prohibiting students from applying to more than one college. This bill will allow students to apply to more than one college and not worry about the application fee. <h3>Section</h3> 2: Currently the students in South Carolina have to pay an application fee for most colleges they want to apply to. Repealing the fee on public colleges applications will encourage more students to apply to more than one school. Also it will encourage students to apply for in state schools because it will lessen the economic burden. Application fees are a barrier to getting an education and this bill will decrease the barrier between the students and their education. This bill will encourage all students of all social classes. Those that are of lower income will benefit from being able to apply to a greater variety of colleges so that they may choose the best financial and educational option for them. The voucher system for low income students that is currently in place is not enough of a financial incentive, by making the applications free these students will be encouraged to apply to a greater number of colleges, therefore increase their odds of getting into a better school with better financial options. <h3>Section</h3> 3: The State Government should fund the money for application fees through the South Carolina State Education Lottery. The money from the lottery will be split between two-year colleges and four-year colleges. <h3>Section</h3> 4: We will enforce the bill by making public colleges allow students to apply for free. The Government of South Carolina will be the ones to enforce the bill. If the state colleges fail to comply with waiving state students application fee, their state funding will be revoked.","billTitle":"An act to revoke South Carolina public colleges application fees.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0vuarB0IIQ8ydWBb","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Cole Parker and Thomas Owens"},"-K3K0xXlC853stA28ilZ":{"author1":"Skylar Clayman","author2":"Ben Martin","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: This act would incentivize South Carolina employers to hire more employees because it would reduce the SUTA (State Unemployment Tax Act) each employer has to pay per worker.  This act would reduce the SUTA (State Unemployment Tax Act) tax rate to a flat and reasonable 1% with no drop-off after gross earnings capped after $200,000 per year versus $14,000. Introducing a flat tax would encourage increased employment on the part of businesses because the varying rates of the SUTA tax rate (0% - 7.855%) discourage higher numbers of employment. This is because whenever a business hires an employee, there is a possibility that said employee would have to be laid off at some point in time, causing the SUTA rates to go up for that particular business. <h3>Section</h3> 2: The problem of a varying and raised SUTA tax rate has been a detrimental encumbrance upon businesses for 7 years, and has cost businesses not only opportunities for growth and expanded employment, but has also cost businesses in South Carolina nearly a billion dollars due to SUTA Dumping (see <h3>Section</h3> 3). This problem's solution is in the form of a flat SUTA rate of 1% imposed on companies corporately held in South Carolina, as oppose to the average 3.91% rate. Another piece to this solution is imposing a slightly raised 2% flat SUTA rate on companies corporately held outside of South Carolina, such as Boeing or BMW. These flat and low tax rates will not only encourage corporations to relocate to South Carolina, but will reduce the amount of money lost due to SUTA dumping because the costs for SUTA dumping will outweigh the cost of actually paying the SUTA rate. <h3>Section</h3> 3: A major issue with the current system of imposing SUTA rates is SUTA dumping. SUTA dumping methods are ways that employers avoid a higher SUTA tax rate or the raising of their SUTA tax rate. Ways that businesses do this are Corporate Shelling and using the New Employer Rate. Corporate Shelling is when a company transfers its payroll to the purchased entity, essentially moving all taxable payroll assets to a new or undeveloped entity with a much lower SUTA rate. The New Employer Rate is when a company files a registration form requesting a new employer account number (Federal ID Number), essentially resetting their SUTA rate. These methods are the two primary methods of SUTA dumping, which create an uneven playing field amongst businesses and costs the state hundreds of millions of dollars annually. <h3>Section</h3> 4: The bill would essentially fund itself, as the money gained from increased taxable assets would go towards the state and in turn to DEW (The Department of Employment and Workforce), which enforces and upkeeps SUTA. <h3>Section</h3> 5: DEW (The Department of Employment and Workforce) will enforce the bill, and is currently paid for by the state employers, which would see an influx of revenue due to more corporately held taxable assets within the state of South Carolina. This surplus that our state would come into would allow for further expansion on the part of the state, thereby allowing more legislative acts to be passed and funded. <h3>Section</h3> 6: This bill would affect business in South Carolina in a tremendously positive way. Not only would the cost per-employee drop significantly, it would encourage outside business to migrate to South Carolina. It is no secret that companies like BMW and Boeing have brought major employment to South Carolina, and their influence on the state's economy has been conspicuously positive. The amount of similarly sized corporations that are present in the state would only increase, as South Carolina would be a place where businesses have real breathing room and can expand throughout the state, creating jobs and opportunities for all South Carolinians. <h3>Section</h3> 7: This bill will take effect on January 01, 2016.","billTitle":"SUTA Flat Tax Proposal","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0xXlC853stA28ilZ","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Adam Compton and Emory Doppelheuer"},"-K3K0yQ-9uO2-M6Tho_2":{"author1":"Annelise Caudell","author2":"Amy Gilpin","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: On June 17th, 2015 there was a terrible tragedy that took place in Charleston, South Carolina. A 21-year old man shot ten people in a church, and nine of them died. Prior to this shooting, the gunman already had a criminal record. If this bill went into effect before this incident, this tragedy may have been able to be prevented. Our bill will require any person that wishes to purchase a firearm pass a mandatory background check. <h3>Section</h3> 2: The general idea behind background checks is to check individuals for any criminal or public safety record to prevent them from owning a firearm. We believe that this is legitimate because the state should not allow people with certain mental disabilities and public safety charges to possess firearms. Some may view this as interfering with our 2nd Amendment rights, the right to bear arms, but it is for the greater good and should reduce crime rates in South Carolina. A new study from Johns Hopkins Center for Gun Policy and Research has found Missouris decision to repeal its law, requiring all handgun purchasers to pass a background check, led to a 16 percent increase in the state murder rate. People purchasing firearms would have their name run through the National Instant Criminal Background Check or NICS.Some may argue that the government cannot tell people which products they can and cannot buy, but this is also for the greater good of the public and if someone passes the background check, there is no reason they should not be able to purchase a firearm. <h3>Section</h3> 3: Funding for the background checks will come from an additional 1% tax on the purchase of firearms and ammunition. A statewide background check typically costs $10-20. Background checks are not free, but are cheap and easy to do. <h3>Section</h3> 4: Individual vendors will enforce the stipulations of this bill. If this became a law, they would be legally obligated to run background checks. If someone fails a background check then there will be no repercussions for those attempting to purchase a firearm. Appeals can be made if someone has a criminal record for a nonviolent charge (drug possession, minor in possession of alcohol, etc.). Appeals would be submitted to the NICS <h3>Section</h3> s Appeal Services Team and/or the state branch of Alcohol Tobacco and Firearms (ATF). <h3>Section</h3> 5: This bill will be signed into law and take effect on January 1, 2016.","billTitle":"An Act to require a background check before purchasing a firearm.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0yQ-9uO2-M6Tho_2","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Elissa Izumi and Reagan Moody"},"-K3K0zJVsKuqtfI_umS7":{"author1":"Lindsey Melzer","author2":"Jordyn Pomar","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1:  As students in South Carolina, we previously and still currently undergo multiple levels of stress due to the overwhelming number of assessments. We feel that a major cause of this is having multiple examinations for multiple subjects in one day. For example, a survey conducted for the American Psychological Association, proves that 83 percent of teens said that school was a somewhat or significant source of stress. This bill is an attempt to reduce the level of stress on teens by permitting only one examination from each subject once a week. Basically each subject will be assigned a specific day to conduct examinations aka tests and quizzes. <h3>Section</h3> 2:  As mentioned in <h3>Section</h3> one, we are highly concerned about stress on students.  Students stress out over there grades. Our bill will fix this problem by allowing more time for students to study. In the state of South Carolina, all public schools will follow a certain examination schedule. A rough draft of the basic core subject schedule is: Mondays will be math days, Tuesdays will be science days, Wednesdays will be social studies days, Thursdays will be related arts day, and Fridays will be English days. This schedule does not include students taking more than one class in the same general subject, that can be determined by the specific school. Furthermore, this schedule allows students, teachers, and parents to be more organized as well as remain healthy, balanced lifestyles. However, if there is a need to make up any examinations that a student missed, then the make-up assessment can be taken on any day of the week, as long as it is prearranged with the teacher. Also, if there are days missed sue to national holidays/breaks and or bad weather (snow days) then teachers will be allowed to assign assessments any day on the prior week or the current week, as long as students have a two day noticed. We understand that teachers want to assign assessments whenever because they want to test our knowledge. Although, from a student perspective, it takes more time to fully understand the material so that it can help us in the long run. Specifically, students can focus on studying in one subject, instead of studying multiple subjects at once, as well as receive more time to study, so that it can be useful in real life. <h3>Section</h3> 3:  Our bill does not need to be funded, because all it takes is communication and enforcement. Once a final schedule is in act, teachers will then be left to plan lessons and examinations around a specific day. If the teachers dont follow the instructed schedule and assign examinations on their unassigned day, then students will be allowed to retake the same test on the upcoming assigned day. <h3>Section</h3> 4:  This bill will be enforced by the State Board of Education in South Carolina. Once this is put into place, the bill can be further enforced on a local level by districts. <h3>Section</h3> 5:  When signed into law by the governor this bill will take place on January 1, 2016.","billTitle":"An Act to Lighten the Stress Level of Students","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K0zJVsKuqtfI_umS7","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Alexandra Robinson and Kendall Heflin"},"-K3K1-3VXBIDBcaSOPJw":{"author1":"Ashlyn Kearney","author2":"Lindsay White","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1:This bill would change the current start time for all SC public high schools to 9:45 and change the end time to 4:45.  Studies show that, on average, teenagers need nine and a half hours of sleep to perform at their highest level of ability in school.Not getting enough sleep leads to an inability to listen, concentrate, and solve problems, which are basic activities that you are expected to be able to do on a daily basis in any learning environment.  On top of this, many kids have extracurricular activities after school. This is also very difficult for individuals who take classes that come with heavy workloads at night, such as honors and AP classes. From these reasons, we concluded that for students to get enough sleep to function at their maximum ability, the school starting time should be later. <h3>Section</h3> 2: We propose that school should start 1 hour later, at 9:45 am. Pushing the school start time back one hour makes up for the time difference between that average time and the amount that students should be receiving. If school starts at 9:45, that would push back the end time to 4:45pm. This time is convenient, as most parents have jobs that end around that time. With this start time, the average individual would wake up at 8:00am, rather than 7:00. This means that the average kid that goes to bed at 11:00 will get 9 hours of sleep, which will enable them to be able to better perform their daily tasks at school. With this new start time, students will not be as tired during classes, and they will likely be able to better concentrate and absorb the information they are being taught. This not only helps the students, but will also help the schools. With kids having a better ability to learn, it is only logical to assume that they would then get higher grades. With higher scores on tests, quizzes, and state/national assessments, schools would be much higher looked upon. <h3>Section</h3> 3: Unlike most bills, this bill can be put into effect without any additional funding.  It would involve altering teacher contracts to allow them to work at different times.  It would also change school bus schedules and cafeteria schedules, but it would run like a normal day, simply pushed back an hour.  That would mean there is no need for extra funding. <h3>Section</h3> 4: The South Carolina Board of Education, the main governing body of all public schools in South Carolina, will put this bill into effect for all SC public schools. <h3>Section</h3> 5: Our bill will go into effect the beginning of the 2016/2017 school year. school year.","billTitle":"An Act to delay the starting time of public schools","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1-3VXBIDBcaSOPJw","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Claire Griffith and Ellie Howard"},"-K3K107QaWDC5-iN6S-H":{"author1":"Aaron Compton","author2":"Keegan OConnell","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Welfare is a program that is designed to help provide the basic necessities for people living in or below poverty. Welfare is paid for by taxes. Unfortunately, this program is often abused by many people to purchase illegal drugs. This Bill would only be implemented for those who are receiving need welfare, not Medicare; the reason for this is because more people on welfare abuse the help they receive than on Medicare. <h3>Section</h3> 2:  In South Carolina, we have roughly 38,000 citizens on welfare. However, there are no laws that require an applicant to be subject to mandatory drug tests. <h3>Section</h3> 3: Drug tests for every recipient of welfare would have an estimated cost of $500,000 per month. Therefore, if a 53% tax increase on cigarettes was imposed it would provide the cost of the tests. A 53% tax increase is equivalent to a 30 cent raise. <h3>Section</h3> 4: The proposed law will be enforced by:   A signed contract with the recipient stating that he or she is subjected to a monthly drug test while receiving welfare and accepting the penalties of the three strike system.   A three strike system will be implemented to insure welfare program will not be abused.   The first strike will be a written warning that will go on a permanent record.   The second strike results in the size of their check will be reduced for that month.   The third offense will result in the termination of the recipient from the program. They will be permitted to reapply to the program after six months has passed.","billTitle":"An Act to prevent the abuse of welfare","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K107QaWDC5-iN6S-H","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Leo White and Myles Daniels"},"-K3K11ISjEp4ktzyuBox":{"author1":"Phoebe Copel","author2":"","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, South Carolina is second in the nation in the number of women murdered by men, only recently being surpassed by Alaska for the number one spot. The state has been in the top ten on the list for the past decade and topped the list three times in this period. Over the last ten years, more than 300 women have died at the hands of a man in South Carolina. As far as domestic violence, 36,000 cases are reported annually in the state. And too many times murder and domestic violence are related. The state has done little to nothing to help either of these problems, as is illustrated by a steady homicide rate of women by men for the last 15 years. This bill will drop these frightening statistics by inflicting harsher punishments on abusers, and providing more ways for the victims to get help and feel safe. It will also lower the rate of women killed by men, as it would stop these men before they get to the point of killing their victim, as well as moving women to do something earlier because they know their state cares and wants to whats right to keep them safe. <h3>Section</h3> 2: Right now, in South Carolina, someone convicted of domestic violence has to be convicted three times before they are charged with a felony. On a first or second offense, they can be fined and put in jail for as little as thirty days. So after a month in jail, what is stopping them from returning to their old habits of abusing their victim(s)? This constant abuse is what leads the abuser to eventually commit murder. <h3>Section</h3> 3: Right now, in South Carolina, domestic violence is not a priority. Funding for this bill would come partly from sales taxes, but mostly from state funding. We need more ways for these women to get help. Unfortunately, there arent enough resources and domestic violence shelters (right now, 46 counties in this state have animal shelters, while only 18 have domestic violence shelters) for every request to get the help they need. Of the victims that dont get help, about 60% return to their abusers. The state would pay to build more shelters that provide care for domestic violence victims. This would include opening shelters in half the counties in the state that dont have them, as well as increasing the funding towards the preexisting shelters so that every plea for help can be met. Taxes from sales tax and property tax would go to any costs related to imprisoning the accusers. <h3>Section</h3> 4: We need stricter laws with stricter punishments for domestic violence crimes, so that women can finally feel free from the constant cycle of abuse they suffer through. Local Law Enforcement can enforce this bill by extending the amount of time in prison convicts spend and charge them on their first offence, not third. The cost for holding the guilty accountable would not be that large, but any additional costs involved in detaining and punishing the accused would come from taxpayer dollars. <h3>Section</h3> 5: This bill will be beneficial to our state for the following reasons:   It will contain people who commit domestic violence.   It will provide protection and safety for women who are victims of domestic violence.   It will decrease the amount of deaths and domestic violence rates committed in our state. <h3>Section</h3> 6: When this bill is signed into law, it will be taken into effect on January 1st, 2016.","billTitle":"An Act to Prevent the Homicide and Abuse of Women","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K11ISjEp4ktzyuBox","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Kylie Feniger and Elouise Usry"},"-K3K128IXm46FyMHsP0F":{"author1":"Matthew Foody","author2":"Jackson Morrissey","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: The poor condition of South Carolina roads has caused at least one fatality and numerous injuries, along with car repair bills from blown tires, dented rims, and broken windshields. One reason that South Carolina has bad roads is because South Carolina has the fourth-largest state maintained road system in the United States, but the third-lowest gas tax to pay for the maintenance. The South Carolina Department of Transportation (SCDOT) has to maintain over 40,000 miles of roads, but South Carolina politicians rarely raise taxes. The states gas tax of 16 cents a gallon hasnt been raised since 1987. South Carolina has some of the lowest gas prices in the country. We propose to add an extra 5 cent tax per gallon to help increase the quality of our roads. Though this amount does not seem much, it starts to add up. This will cause people to spend money on gas instead of car repairs which will save people money in the long run. <h3>Section</h3> 2: 47% of the roads are considered to be in poor condition and 19% are considered to be substandard, according to fixscroads.com.  The average cost to repair a flat tire is $10 and this does not include the cost to repair dented rims or broken windshields. With damages to cars these amounts start to add up to a lot of money because of the poor roads that we are driving on. <h3>Section</h3> 3: There will be no need for funding for this bill as the tax will be added to the price of gas. This law will be enforced by every gas station in South Carolina. the penalty for the gas stations who do not enforce the law will be penalized with a fine of two thousand dollars every week they don't enforce the tax. <h3>Section</h3> 4: The benefits of this bill are:    We will have better roads. The tax will give SCDOT the money to improve the roads.    Cars will not get as beat up because of bad roads. This will help people not have to spend as much money on repairing their vehicles.    With better roads, SC will be able to attach more businesses, as quality infrastructure can be a key component for whether new businesses decide to open in SC, thus creating more jobs. <h3>Section</h3> 5: This bill will be signed into law and take effect on January 1, 2016.","billTitle":"An Act to Improve Our Roads","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K128IXm46FyMHsP0F","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Lydiah Griebel and Madison Hammond"},"-K3K13OAXaR37CIvGnBd":{"author1":"Mary Evelyn Brown","author2":"Colleen Daly","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently there is not a law in South Carolina that requires its citizens to recycle.  This bill would place a 15 cents tax per aluminum and/or glass bottle purchased in SC.  Examples of these items are soda cans, water bottles, beer bottles, and wine bottles or wine cooler containers. The revenue generated by this tax will be distributed as follows:  five cents to the store for collecting the recyclables, 5 cents towards funding public education in SC, and 5 cents towards improving SC roads. <h3>Section</h3> 2: Currently in South Carolina recycling is optional. Either participants pay taxes for it to be picked up (for example those who live in the city limits often pay higher taxes, but receive recycling) or citizens take it to a landfill or recycling center.  This law would incentivize all stores to purchase machines that process recyclable material in order to obtain the 5 cents return on each bottle/can. <h3>Section</h3> 3: The law will be overseen and enforced by the SC Department of Revenue who will distribute monthly checks to stores, the department of education, and department of transportation based on the amount of recycling received.  The recycling will be collected by the non-profit Palmetto Pride and any expense associated with the collection and drop off of recycled items will be taken equally out of the revenue generated prior to organizations involved being paid. <h3>Section</h3> 4: The justification for such an Act follows:   The state recycles 29.2% of its recycled waste. Because of this in effect in other states, there have a higher recycling percentage. For example, Californias population recycles 49%, Delaware is 40%, Michigan is 31%, and Vermont is between 30-35%    The roads in South Carolina are in terrible condition and the schools need to be improved so this new revenue source could help improve to important aspect of SC.  There are similar affective acts in other states such as California and Michigan.   South Carolina generates about 4.2 million tons of trash in landfills each year. Inmate crews have picked up over 368,000 pounds of litter. <h3>Section</h3> 5: The benefits of this bill are as follows:   The funds from this bill go to the store (five cents), schools and education (five cents), and to help improve the roads (five cents).   This bill will help the environment and it will incentivize people to want to improve the environment.   It will also help reduce the amount of waste generated.   Stores who choose to participate will get more customers.   It would keep parks and roadsides cleaner. <h3>Section</h3> 6: This bill will be signed into law and take effect on January 1, 2016","billTitle":"An Act to Return Bottles and Cans","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K13OAXaR37CIvGnBd","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Aaron Potter and Allison Buehler"},"-K3K15CmBM2hdQ_aFIT0":{"author1":"Alex Simmons","author2":"Riley Hill","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Many women are faced with the difficult decision of receiving an abortion. Although there are many other options to consider about the fetus life, terminating the pregnancy is always a choice. To reduce the occurrence of abortion, a law should state that the mother must have a deadly condition that requires the need for the pregnancy to be terminated for the mother to survive, in order to receive an abortion. <h3>Section</h3> 2:  The bill will state that the mother needs to have a life-threatening condition to execute the abortion. If the mothers life is at stake and will die because of the fetus a trained doctor at an abortion clinic, hospital or private practice is allowed to abort the fetus. If the abortion is by medication the woman must have a prescription to obtain say Mifepristone. In South Carolina it is required that an abortion clinic has a license in order to practice abortion. Abortion clinics or any practice executing abortions will have to obtain a new license with a requirement to meet the new standard of only practicing on women with deadly circumstances <h3>Section</h3> 3:  In South Carolina public funding is already provided for abortion in pregnancies endangering the mother or that are a result of rape or incest. Rape and incest no longer will qualify the mother for an abortion. Without the need for the funding for rape victims or incest the funds previously provided for rape and incest will go to Department of Children and Family Services and Department of Health and Environmental Control. <h3>Section</h3> 4:  The bill will be enforced by the Department of Children and Family Services, OB-GYNs, Physicians, and any doctor taking part in the abortion. Doctors would be required by law to recommend or perform an abortion only if it is absolutely necessary for the mother to survive. If a doctor is found guilty of approving of the disposal of a fetus without need the doctor will be faced with criminal charges. If the mother is denied an abortion due to not meeting the medical requirements, then DSS will offer the mother adoption options and other places for the child to go once born.  The South Carolina Department of Health and Environmental Control would enforce the requirement by requiring facilities to have on record every abortion and proof of a doctors approval. If the facility is unable to provide the necessary information then the Department of Health and Environmental Control would then be able to be shut down the business.  If any doctor or mother is aware or taking part in an unapproved abortion and neglect telling a government official, then they are to be punished according to the extent of the actions. <h3>Section</h3> 5:  This bill will go into effect January 1st, 2016.","billTitle":"An Act to Require All Abortions be Conducted Only When the Life of the Mother is at Risk.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K15CmBM2hdQ_aFIT0","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Carlyn Dorcas and Brenna Whitehill"},"-K3K17dicE1UyW9qaFi0":{"author1":"Jackson Williams","author2":"Ben Reeder","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: This bill would enforce a time limit of one year from the date sentencing to the date the state execution must take place.   Specifically, a person who receives a guilty verdict and is sentenced by a jury of his/her peers to the death penalty will only have one year to appeal his/her case before the state goes through with its execution.  The current state death penalty law states that the death penalty can only be enforced when somebody has knowingly created a great risk of death. Crimes that typically receive death penalty punishments are rape and murder. <h3>Section</h3> 2: The purpose of this bill is to reduce the tax payer burden of keeping a convicted criminal alive when that criminal has already been given due process of the law and received a death penalty conviction.  There has been only 72 executions since 1979, there has only been 1 person executed in the past five years in SC. There are currently 44 people on the South Carolina Death Row being held in the Broad River Correctional Institution. It will cost approximately 17,600,000 these 44 people alive on Death Row in 2015. <h3>Section</h3> 3: This bill would be funded through the savings collected by not keeping as many convicted criminals on death row.  These additional funds would pay for the chemicals and experts who preform state executions. <h3>Section</h3> 4: The Law Enforcement courts will enforce the implementations of the new South Carolina Death Penalty Law. <h3>Section</h3> 5: This bill will go into effect on January 1, 2016 after the youth governor signs it.","billTitle":"An Act to Lead to More Death Row Executions in SC","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K17dicE1UyW9qaFi0","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Emily Ko and Madison Taylor"},"-K3K1B9w502oDpXhN60Z":{"author1":"Sarah Yu","author2":"Hannah Underwood","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: A hate crime is defined as a criminal offense against a person or property motivated in whole or in part by an offender's bias against a race, religion, ethnicity, disability, sexual orientation, or national origin. Examples of hate crimes:   Physically assaulting someone while using derogatory racial, sexual, etc. words   Vandalism or hate graffiti directed toward a group where it will be seen by members of the targeted group   Commission of arson to a facility owned by the targeted group This bill will increase the punishment for a hate crime fueled by hate or prejudice. <h3>Section</h3> 2: Currently in South Carolina there is no law that increases the punishment of a crime fueled by prejudice. Moreover, the existing laws do not effectively protect and dignify the victims of the crime and members of the afflicted community. The latest crime statistics collected by the Federal Bureau of Investigation in 2013, asked agencies in every state but Hawaii, plus Washington, D.C.,to report hate-crime statisticsto the FBIs Uniform Crime Reporting program. South Carolina had 51 reported hate crimes, ranking the 34th highest rate out of the participating 49 states. Most law enforcement agencies are not required to report hate crimes to the FBI, so several other transgressions may be going unreported. <h3>Section</h3> 3: This will be enforced by the state Department of Criminal Justice and local law enforcement. Thestatutes outlawing types of bias-motivated violence or terrorization are as follows:   Physical injury, emotional suffering, loss or damage suffered by members of certain groups   Any person who suffers physical injury, emotional suffering, damage to or theft of his or her property has a just cause of action to intensify the penalty against the person who caused the physical injury, emotional suffering, damage or theft.   Illicit damage to religious and other property or possessions   Any church, synagogue, mosque, or building used for religious purpose.   Any school or educational center associated with a particular race, religion, ethnicity, disability, sexual orientation, or national origin.   Any personal property   Use of combustible materials and/or explosives in attempt of arson <h3>Section</h3> 4: In the event that the crime is proven to be motivated by hate, the assigned enhanced punishments are as followed:   Physical Assault   If crime committed is first degree the revised maximum sentence under this <h3>Section</h3> is 12 years in prison   Includes injury caused by sexual assault, commission of a theft, and an assault.    Likely to produce death or immense bodily harm   If crime committed is second degree the revised maximum sentence under this <h3>Section</h3> is 4 years in prison   Assault results in moderate harm to the body sometimes requiring medical treatment   Sexual assault   If crime committed is third degree the revised maximum sentence under this <h3>Section</h3> 6 months in prison   Referred to as a simple assault/ misdemeanor   Slightly injure or attempt to injure   Vandalism/ Damage of Property   Malicious Injury/property damage- punishment depends on damage value   $5,000 or more- up to 12 years in prison   1,000 to $5,000- up to 7 years in prison   Less than $1,000- up to 2 years in prison   To place of worship- sentence of 10 months to 12 years in prison, depending on severity   Illicit graffiti containing racial, sexist, religious, derogatory slurs   Fine- $1,500 up to $4,000 depending on severity of offense   Potential Jail Sentence- 150 days up to 4 years in jail   Arson   Revised maximum sentence is 7 years I prison","billTitle":"An Act to Establish a Hate Crime Law in South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1B9w502oDpXhN60Z","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Abbie Panuccio and Libby Whitney"},"-K3K1DXEZpfKyzUtxY27":{"author1":"Alex","author2":"ra Berry","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: Minority bias is an ongoing issue in society. Law enforcement officers have large responsibilities when dealing with alleged offenders, so it is important that officers dont exhibit racial bias towards anyone.  Training to reduce racial bias by police could play a crucial role in reducing the impact of prejudice on possible arrests. <h3>Section</h3> 2: As of 2008, African Americans and Hispanics comprise of 58% of the prison population, while only making up a quarter of the U.S. population.  Training to reduce racial and minority bias in law enforcement will bring awareness to unconscious bias that many people, including law enforcement possess. Officers with no previous refractions and are experienced with at least ten years of experience will provide said training, along with sociocultural psychologists. <h3>Section</h3> 3: In order for the anti-bias training to go into affect, ticket fees would provide funding. Per officer, the class would cost $200 to go through one, six-hour course.  Classes would provide officers with realistic scenarios and the constant reminder that bias is not always intentional, but can be prevented through understanding its repercussions. <h3>Section</h3> 4: This specialized minority bias training will be a requirement in order to become a part of law enforcement.  Upon receiving an infraction due to suspected minority bias, said law enforcer must repeat the training. <h3>Section</h3> 5: This bill will go into effect on January 1, 2016.","billTitle":"An Act to Reduce Minority Bias in Law Enforcement","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1DXEZpfKyzUtxY27","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Bryonna Howard and Megan Felt"},"-K3K1GUXyx8HwAkWrwE0":{"author1":"Caroline Ko","author2":"Tristan Clark","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, in South Carolina, it is not a law for all high schools to offer a study hall period.  The option to study periods for high school students are regulated by the individual district.  This bill will give students who have not failed a class and are on to graduate a chance to implement a study period into their schedule. <h3>Section</h3> 2: The current time for each class of 50-55 minutes would be lowered to 45-50 minutes per class.  Study hall will be offered as an elective so if you are not qualified for the study hall option, you can choose a different elective or course for that 35 minute period.  A 35 minute study period would give students many opportunities and advantages such as;    Time to catch up or get ahead on any class work and/or homework.   Time for studying.   Time to work on projects or essays, which is extremely helpful to those without computer access at home.  High school students that participate in extracurricular activities or afterschool jobs, will be able to get work done rather than staying awake all hours of the night and cramming. <h3>Section</h3> 3: Our bill will not require any funding because an administrator will supervise the period. <h3>Section</h3> 4: If, by an administrator advises that the given study period is being abused, it can be taken away or suspended from the student. <h3>Section</h3> 5:  This bill will be signed into law and take effect in August of 2016.","billTitle":"An Act to mandate a Study Hall period for all High Schools in South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1GUXyx8HwAkWrwE0","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Emily Zaino and Rachel Stiles"},"-K3K1RHx312cLLLWya2r":{"author1":"Mary Aiesi","author2":"Lane Ahmed","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1:  The state of South Carolina tends to have a bad reputation for their public school system and their roads. The states public school system continues to be very lowly ranked in their percentage of high school graduates in the country. Also, there are many dangerous roads in this state that have been the cause of a lot of fatal car accidents. With gambling legalized, a lot of money will become available from the casinos, which will then be donated. Roads and the public school system are not the only things that will benefit from the money; a small portion of the profits will also be donated towards helping people with gambling problems, just as the lottery does. Horry Countys established infrastructure for tourism will support limited gambling operations in the state of South Carolina. If gambling becomes legal in only part of state, it will end up benefitting the state more than hurting it. <h3>Section</h3> 2: With the bill, a state commission will be established with five members that are appointed by the governor of South Carolina. The Commission will establish the rules and regulations of operating a casino as well as the application and approval process for issuing licenses. Each member will serve a 2-year term on the Commission before being reappointed or replaced by the governor. With the casinos open, 45% of the gambling taxes will go towards building better roads in the state, 45% will go towards the public school system, and the remaining 10% will fund programs that help people that have gambling problems. <h3>Section</h3> 3: 5 percent of net earnings from gambling operations will pay to the Commission by the casino companies with approved licenses. The casinos themselves will fund to build their casino with the other 95% that they earn from people coming to gamble. <h3>Section</h3> 4: The Commission will establish the rules and regulation of the bill that will lead to enforcement of gambling and gaming that is legalized by this bill. The tax revenue from which the bill will generate will pay expenses associated with the commission and incurred from this bill. <h3>Section</h3> 5: This bill will go into effect once signed on January 1, 2016.","billTitle":"An Act to Allow Limited Licensing of Gambling in Horry County, S.C. To Benefit Roads and Schools in the Entire State","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1RHx312cLLLWya2r","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Sarah Taylor and Virginia Cook"},"-K3K1TXWjGnqXBIh9sDG":{"author1":"Patrick Erwin","author2":"Jackson Caudell","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: Teens in South Carolina are unaware of their own rights that they possess as being young adults, such as privacy and search and seizure rights and invasion of privacy rights. This bill would enact the requirement of a teen completing 1 class session annually in high school educating teens about their rights. <h3>Section</h3> 2: High schools in South Carolina will be required to schedule the 4 hour class once every weekend throughout the year. This allows ample opportunities for students to take the required class when it best suits their schedule. There are at most 35 students per class. The first 2 and a half hours of the class will focus on explaining the necessary content via PowerPoint, while the remainder of the time would be for 30 minutes review session, 30 minutes of study time, and 1 hour for a standardized 50 question assessment, requiring at least 35/50 score to pass the class. If a student fails, then the class must be retaken at the reduced price listed in the 3rd <h3>Section</h3> . The class would be taught by a local policeman who has the certification to take the class. Once a student has passed the class, he or she would be given a certificate for passing, and the school would document their passing on the students transcript, as this class will be required to graduate from a South Carolina Public School. <h3>Section</h3> 3: The cost of manufacturing the standardized PowerPoints and tests and educating the teachers would be accounted for by requiring a $65 fee in order to take the class each time, similar to paying for taking a DMV driving test. If a student qualifies for free or reduced lunch at school due to the economic conditions of their family, they can pay for the class at a reduced rate of 25$, which can be payed in 2 separate amounts- when the student first signs up for the class in advance and when they arrive on the actual day to take the class. Also, if a student fails the class, they will retake the class at the reduced price of 25$. <h3>Section</h3> 4: This bill will be enforced by schools, requiring students to take this class by the end of their senior year in order to graduate.","billTitle":"An Act to Educate Adolescents on Their Citizens Rights","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1TXWjGnqXBIh9sDG","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":"Connor Langner and Margie Hill"},"-K3K1V9vpJErjSZQCh7F":{"author1":"Helen Bonduris","author2":"Grace Taylor","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Animals should not be used for scientific and/or commercial testing because it is using up more money than it would if we tested these products with alternative methods. <h3>Section</h3> 2: Alternative testing methods now exist that can replace the need for animals. For example, human cells from volunteers can be used for scientific and/or commercial testing of products. Artificial human skin can be made from sheets of human skin cells and is grown in test tubes. This can produce more useful and reliable results than animal testing. Scientists can experiment with human cells obtained from volunteers. They can use artificial human skin that is grown in test tubes using human skin cells. They can use virtual models of human molecular structures and predict the toxicity of substance. Another reason why human cells should be used instead of animals is because drugs that pass animal tests arent always safe or reliable. The last reason why we should not test on animals is because it is wasteful. Scientist put harmful chemicals on innocent animals. Either the experiment works or it fails, but what happen if it fails? They just throw the animal away! <h3>Section</h3> 3: Many non-animal tests, such as Vitro, have been compared to animal tests. Vitro has been proven to cost a lot less than animal tests. Vitro is the type of experiments that uses artificial organisms rather than animals that gives back even better results. For example, a rat phototoxicity test costs $11,500 but a Vitro test costs $1,300. These artificial organism tests would save a lot of money, enabling scientists to conduct more tests and experiments. About $15-16 billion of taxpayer money goes toward animal testing which is the money that would go towards funding our bill since it will no longer be needed for animal testing. Those that do continue to conduct tests on animals will have these punishments conducted by the USDA:   1st Offense: $50,000 fine   2nd Offense: $100,000 fine   3rd Offense: 6 months in prison (judge decides on bail amount)   4th Offense: 1 year in prison (judge decides on bail amount) <h3>Section</h3> 4: The SC Department of Agriculture is in charge of and is enforcing the animal welfare act in South Carolina and would also be in control of making sure no products are tested on animals in the state of SC. <h3>Section</h3> 5: When signed into law, this bill goes into effect on January 1, 2016","billTitle":"An Act to make animal testing illegal","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1V9vpJErjSZQCh7F","rocketDocketStatus":"no","school":"J.L. Mann High School","sponsor":" "},"-K3K1k9mA8BWCIwsmGk3":{"author1":"Sophia Higgins","author2":"Banks Floyd","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: There are currently no laws that require a later start time for students. Early start times are causing students to lose hours of sleep and leading to exhaustion. <h3>Section</h3> 2: This law would lessen sleep deprivation in teens and promote a more focused learning opportunity. Early start times prevent the students' brains from waking up and cause loss of focus and concentration. Teens need around 8-10 hours of sleep each night to function. A study from National Sleep Foundation showed that only 15% of teens get 8 1/2 hours of sleep on school nights. <h3>Section</h3> 3: Schools will change their normal scheduling to begin class at 9:00 AM and will continue with the normal hours of school from before. <h3>Section</h3> 4: Schools that continue to begin before 9:00 AM will be temporarily shut down while a new schedule is organized. This will be monitored by the South Carolina Department of Education. <h3>Section</h3> 5: When signed into law by the Honorable Youth Governor, this law will go into effect January 1, 2016 and will be enforced at the beginning of each school year.","billTitle":"An act to prohibit schools from starting class before 9:00 AM.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1k9mA8BWCIwsmGk3","rocketDocketStatus":"no","school":"Hammond School","sponsor":" "},"-K3K1mTHUaCHhZOuLjUp":{"author1":"Mikayla Turner, Morgan Walker,","author2":"Taylor McGruder","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: The state of South Carolina has a significantly high population of veterans who have fought for our country and our freedom. Through this bill, a percentage of income tax for veterans, both retired and medically discharged, will be lowered. <h3>Section</h3> 2: Veterans transitioning to civilian life already have difficulty with obtaining stable and profitable jobs. However, this bill will assist veterans with their financial struggles, help them provide for their families, and if medically discharged, could help them recover from post trauma or fear from previous duties. This bill qualifies for South Carolina state residents only. This bill does not apply to veterans dishonorably dis-charged. <h3>Section</h3> 3: Veterans will be granted a card that, when it is presented and validated, will allow them to receive 3% off income tax. Cards will be charged at 7$ and veterans must apply and fill out a form under South Carolina Veterans Association and South Carolina department of Revenue in order to obtain and clarify the use of said card. The cards will have a special stamp on them so that the government will be able to verify that the card is real and not fraud. Anyone caught using a fraudulent card can be convicted with fraud charges and will result in criminal punishment by law. <h3>Section</h3> 4: South Carolina office of Veterans Affairs will reach out to veterans and tell them about the card. They will also help guide them through the paperwork process be-tween the SC department of revenue. <h3>Section</h3> 5: When signed into law by the Honorable Youth Governor, this law will go into effect January 1, 2016.","billTitle":"An Act to have 3% of Tax Income Decreased for Veterans","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K1mTHUaCHhZOuLjUp","rocketDocketStatus":"no","school":"Hammond School","sponsor":" "},"-K3K2AxN8SBBnaCwTAiB":{"author1":"Lizzie Richards, Mariam Elgeneidy,","author2":"Drew Turner","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: Men and Women are not being paid equal amounts currently in the United States. Women would have to work 60 extra days just to earn what men did by the end of the previous year. On average women get 75 for every $1.00 that a man gets. This bill is imperative in today's world. <h3>Section</h3> 2: This bill would help raise the amount of money that women would be getting from their jobs. The three top jobs that pay women less then men are Health Technicians, Counselors, and Pharmacist. These are often typical jobs had by women. This bill will help the women of today. It will show people that men and women are in fact equal. <h3>Section</h3> 3: This bill will enforce equal pay for men and women. It will raise women's pay so it is equal to the amount of money than a man gets paid. Companies and businesses will help enforce this law. <h3>Section</h3> 4: If companies/businesses fail to comply, they will be fined maximum of $5,000.  This money will come from the company-business.","billTitle":"An act to raise the pay of women to the same amount that men are being paid","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K2AxN8SBBnaCwTAiB","rocketDocketStatus":"no","school":"Hammond School","sponsor":" "},"-K3K2H4zJQN5-CGAA1YM":{"author1":"Caleb Weis","author2":"Gracie ORiordan","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: This Bill will eliminate the option of assigning the death penalty to convicted criminals and others sentenced to death by the court of law. <h3>Section</h3> 2: All criminals who are already on death row shall still receive capital punishment. <h3>Section</h3> 3: The death penalty will be replaced with life in prison, without parole. <h3>Section</h3> 4: The court can also sentence criminals to life in solitary confinement. <h3>Section</h3> 5: Some believe that life in prison will cost more than capital punishment, but that is not true. In South Carolina a single death penalty case carried out to execution costs taxpayers an average of $1.1 million more than life without parole. A single death penalty trial, not going to execution, costs approximately $415,240 more than a non-capital murder trial. <h3>Section</h3> 6: If passed, will go into effect January 1, 2016.   SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature  November 18th  21st","billTitle":"An Act to Nullify Capital Punishment","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K2H4zJQN5-CGAA1YM","rocketDocketStatus":"no","school":"Bluffton High School","sponsor":"Hannon, Oliver"},"-K3K2TfebT_LC942BWtK":{"author1":"William Schmidt","author2":"Serena Lin","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state requirements to receive food stamps as a single able-bodied person without dependents are as follows:   Applicant must receive 1,276 dollars of monthly income or less.    Able to show proof of citizenship or documentation showing lawful residence in the U.S.   Provide current/recent health insurance, housing, and utility expense information.   Resource information such as bank accounts, vehicles, homes, property, insurance, etc. <h3>Section</h3> 2: This state reform would add a requirement to receiving food stamps. This requirement would include either volunteering for six hours per week, attending a state job training course, or working 20 hours per week at a paid job. <h3>Section</h3> 3: By implementing this bill, money would be saved due to the fact that many people would not comply with the work requirements. In Maine, where this bill has been put into place, 78% of the people who were on food stamps had been removed. If this were to happen in our state, then there would be a significant decrease in food stamp participants. The purpose of this bill is not to completely remove all food stamp participants, but to eliminate the dependency on the food stamps. By putting in place these work requirements, there is no longer a dependency on food stamps. <h3>Section</h3> 4: The gained revenue from this bill would go to:   The increase of job training centers/fairs.   The availability of public transportation to rural communities.    The South Carolina Education fund.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28TH ANNUAL MODEL LEGISLATURE NOVEMBER 18th  21st","billTitle":"An act to decrease sentencing time for non-violent ownership drug crimes","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K2TfebT_LC942BWtK","rocketDocketStatus":"no","school":"Bluffton High School","sponsor":"Hannon, Oliver"},"-K3K2W3o62IwByckfosS":{"author1":"Elaine Guo","author2":"Giovanna Lopez","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state government does not require the possession of permit to purchase a firearm, and the registration of the purchased firearm afterward. <h3>Section</h3> 2: Prior to obtaining the firearm, the purchaser must fill out a permit application form with the local or state government. A background check is then conducted, and buyers must present proof that they have completed a firearm safety course. The initial fee for the firearm permit will be $50, and every 6 years afterwards it must be renewed with a fee of $25. <h3>Section</h3> 3: The purchased firearm must be registered with local law enforcement within 4 days to record the ownership of the firearm. To register a newly purchased firearm, the buyer must provide a completed application for firearm registration. Part of the application must be completed by the seller. <h3>Section</h3> 4: To purchase a special case weapon, which include but is not limited to:   Shot guns    Sawed/ Off rifles    Hand grenades    Assault weapons    Machine guns  buyers need a 30-day license. The issuing of these licenses will be similar to the process of issuing permits. A license application must be completed, along with a background check and a safety test. The licenses will be issued by the state government. <h3>Section</h3> 5: Current gun owners are required to obtain a license and register their firearms once this bill goes into effect. The normal processes will be completed as if the firearms are newly bought. The deadline is a week after the bill will go into effect, and will be punished with a continuing fine of $2,000 every week after the deadline.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature  November 18th  21st","billTitle":"An Act to Require a Mandatory Permit and Required Registration for Purchase of All Firearms","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K2W3o62IwByckfosS","rocketDocketStatus":"no","school":"Bluffton High School","sponsor":"Wheeler, Story"},"-K3K3pm5Z0asr87BIZ0A":{"author1":"William Schmidt","author2":"Serena Lin","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state requirements to receive food stamps as a single able-bodied person without dependents are as follows:   Applicant must receive 1,276 dollars of monthly income or less.    Able to show proof of citizenship or documentation showing lawful residence in the U.S.   Provide current/recent health insurance, housing, and utility expense information.   Resource information such as bank accounts, vehicles, homes, property, insurance, etc. <h3>Section</h3> 2: This state reform would add a requirement to receiving food stamps. This requirement would include either volunteering for six hours per week, attending a state job training course, or working 20 hours per week at a paid job. <h3>Section</h3> 3: By implementing this bill, money would be saved due to the fact that many people would not comply with the work requirements. In Maine, where this bill has been put into place, 78% of the people who were on food stamps had been removed. If this were to happen in our state, then there would be a significant decrease in food stamp participants. The purpose of this bill is not to completely remove all food stamp participants, but to eliminate the dependency on the food stamps. By putting in place these work requirements, there is no longer a dependency on food stamps. <h3>Section</h3> 4: The gained revenue from this bill would go to:   The increase of job training centers/fairs.   The availability of public transportation to rural communities.    The South Carolina Education fund.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28TH ANNUAL MODEL LEGISLATURE NOVEMBER 18th  21st","billTitle":"An act to decrease sentencing time for non-violent ownership drug crimes","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K3pm5Z0asr87BIZ0A","rocketDocketStatus":"no","school":"Bluffton High School","sponsor":"Hannon, Oliver"},"-K3K4AKT8Z4viMnHZMJ8":{"author1":"Jonathan Mathews","author2":"Katlynne Cuff","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1:The current state restrictions for driving privileges are based upon physical ability to drive. <h3>Section</h3> 2:A restriction on your driver license limits when you can drive or requires that you meet specific conditions when you drive. Thus, requiring elders to retake their drivers test at 65 years of age. <h3>Section</h3> 3:As adults age they are at higher risk of getting into car accidents more often than younger kids like teenagers. If elders do not have any kind of assistance with their medical conditions then they are given a restricted license based on their age. If theyre between the ages of 60 and 65, then theyre restricted license will require them to have a legal driver in the car with them. If they are 70 or older without assistance, they arent allowed to drive. <h3>Section</h3> 4:If this bill is passed, it will allow the state to improve safety wise as well as our daily lives there will be less of a risk. It will also help economically because there will be less money that the citizens themselves will have to pay There will also be less insurance money that will need to be paid, and finally the state wont have to pay to have the damage on the roads fixed. <h3>Section</h3> 5:Revenue from this tax would fund:   The making of drivers licenses in South Carolina cities.   The use of alternate ways to transport the elders that are not able to drive. For example, they would fund buses, taxis, and car rentals   Would help lower the cost of renewing a driver's license for someone over 60 years of age. <h3>Section</h3> 6:If this bill is passed, it will go into effect January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th  21st","billTitle":"An Act to Provide Free Higher Education and Educate the Workforce","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K4AKT8Z4viMnHZMJ8","rocketDocketStatus":"no","school":"Bluffton High School","sponsor":"Young, Macioszek"},"-K3K4NEFSiu3wjiH-cnv":{"author1":"Bradley Bynum","author2":"William Hodge","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: Traffic Safety Cameras would be put up at red lights in the states three largest cities, Columbia, Greenville and Charleston, to catch illegal activity of drivers. These cameras would take a picture of the driver's license plate and the driver of the vehicle and send them a ticket for running the red light. <h3>Section</h3> 2: This would promote greater awareness of traffic safety laws and encourage better driving habits, making driving safer for others. Collected fines, in turn would benefit and fund the state government with more money to spend towards traffic safety and or roadway improvement. <h3>Section</h3> 3: $1,500,000 worth of funds previously used towards School Bus Lease and Purchase could be used instead for the installation of Traffic cameras in major cities in South Carolina. Traffic cameras would be used for ticketing unsafe drivers. A 50% of the money gained from tickets can be used for roadway improvement and the other 50% back towards other state funds. <h3>Section</h3> 4: Income from this program will benefit the State in the following ways:   Improved traffic flow on crowded and rural areas by creating new and more efficient roadways.   Road repair and improvement will reduce the amount of damage done to vehicles through unsafe road conditions.   Create jobs for people that are qualified for work in the field of traffic safety and construction.   Improve overall safety of drivers due to the knowledge of possible tickets because of traffic cameras. <h3>Section</h3> 5: When signed into law: cameras will be put up in their respective areas by January 1, 2017.    SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th  21st","billTitle":"An Act to Repeal Ban on Traffic Cameras","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K4NEFSiu3wjiH-cnv","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Ben Hopkins"},"-K3K4OcX0SUuyKRwH-1T":{"author1":"Tre Canty","author2":"Sophia Montanari","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current minimum wage salary an hour is $7.25, it can be raised to $8.25 an hour, which increased about $1.00. <h3>Section</h3> 2: The minimum wage for South Carolina is $7.25, so it would be raised $1.00. <h3>Section</h3> 3: An increase in the minimum wage would allow minimum wage workers to earn a salary closer to $8.35 per hour that is considered a living wage for households with two working adults. <h3>Section</h3> 4: A raise such as this would:   Would help decrease the number of people on welfare   Allow workers the ability to pay for transportation to and from work   Also allow help reduce the number of children in S.C. who live in poverty, currently 28% of children in the state of S.C. live in poverty and many have parent(s) working full or part time. <h3>Section</h3> 5: When signed into law, the first increase will take place on January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th  21st","billTitle":"An act to require S.C. employers to pay $1.00 more than the Federal minimum wage","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K4OcX0SUuyKRwH-1T","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Rebecca Dunn"},"-K3K4P_wC1M6BuxIGfbL":{"author1":"Jake Powell","author2":"Christopher Castro","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Domestic violence is defined as: A pattern of abusive behavior in any relationship that is used by one partner to gain or maintain power and control over another intimate partner.  Domestic violence can be physical, sexual, emotional, economic, or psychological actions or threats of actions that influence another person. <h3>Section</h3> 2:  The current policy for a reported case of Domestic Violence gives the victim of the Domestic Violence the choice of whether or not to prosecute their abuser.  This would be changed, so that the abuser is always put on trial.  Essentially the case cannot be dropped by the victim. <h3>Section</h3> 3:  This bill is needed because many current cases of Domestic Violence are being dropped by the victim, even though there is sufficient evidence to prove the abuser guilty, mainly for economic reasons (not economically independent). However the victims well being is more crucial than their financial standings. <h3>Section</h3> 4:  This bill will decrease the amount of cases of Domestic Violence because in a lot of Domestic Violence cases the violence continues and can escalate to more serious actions after the case is dropped by the victim, meaning if abusers were punished earlier when the situation was first reported, the victim's abuse would be relieved earlier. <h3>Section</h3> 5:  When signed in to law, this policy will be put into place January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to reduce Domestic Violence","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K4P_wC1M6BuxIGfbL","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Hampton Randall"},"-K3K4QTQw0ESESD8MHqw":{"author1":"Katie Coggins","author2":"Logan McLaughlin","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: Restaurants in major South Carolina cities, such as Charleston, Columbia,  and Greenville, would be required to make available all leftover, uneaten food to  homeless shelters. <h3>Section</h3> 2: Restaurants are throwing away almost 50 million pounds of food a day and  33.7 million tons of food per year is being wasted. If the national food losses could be  reduced by just 15% it would save enough food to feed 25 million more hungry  Americans.  There are over 6,000 homeless people in South Carolina. Restaurants in  South Carolina waste about 131,937 tons of food a year. <h3>Section</h3> 3: This proposal would require restaurants in major South Carolina cities, such  as Charleston, Columbia, and Greenville to make available all the leftover, uneaten food  that they have at the end of the day to a homeless shelter. Shelters will be responsible  for transporting the food either by using volunteers or through existing vehicles owned  and operated by the shelter. Funding for this will come from donations. <h3>Section</h3> 4: This proposal will help:   Cut down on restaurant food waste   Feed the hungry in South Carolina <h3>Section</h3> 5: When signed into law, restaurants would start donating their food on  January 1, 2016.","billTitle":"An Act to Require Restaurants in South Carolina to Give Leftover Food to Homeless Shelters","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K4QTQw0ESESD8MHqw","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Kailey Grooms"},"-K3K4RGb7FU6LiXDmV86":{"author1":"Annisa Mahaffey","author2":"Sarah Farley","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Smoking in moving vehicles would be prohibited. <h3>Section</h3> 2: Smoking in moving vehicles would be prohibited in order to insure that the vision of the driver is not obstructed by smoke, to prevent possible fires, and to decrease the amount of possible distraction to the driver. <h3>Section</h3> 3: If caught with a lit cigarette in a moving vehicle, the first offense will be a $50 fine. The fine will increase by $50 for each offense until the offense which will be the revocation of the drivers license. <h3>Section</h3> 4: Banning smoking in a moving vehicle will decrease the number of automobile accidents by one percent each year in the United States (seeing as one percent of all motor vehicle accidents in the United States each year occur as a result of smoking and driving). <h3>Section</h3> 5: When signed into law, the ban of smoking while in a moving vehicle will take place on January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th  21st","billTitle":"An Act to ban smoking in moving vehicles.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K4RGb7FU6LiXDmV86","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":""},"-K3K51VzmHhva_2l8QZz":{"author1":"Liz Funderburk","author2":"Katie Young","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current GPA required for a college student to maintain the LIFE scholarship is 3.0, would be decreased to 2.5. <h3>Section</h3> 2: The lowered GPA of 2.5 would allow more students to graduate from college that would otherwise consider dropping out of college when they lose their scholarship. This will increase the amount of citizens in South Carolina getting their degree and getting higher paying jobs. <h3>Section</h3> 3: Many schools in the state of South Carolina do not properly prepare students for college. South Carolina landed 37 spots on the list of the top 100 worst schools in the Nation. When students that attend these schools that dont properly equip them with the skills and knowledge to be successful begin college, they quickly lose the 3.0 GPA that got them the scholarship. These hardworking students are then in danger of losing the $2,500 scholarship given to them for their good grades. Without this scholarship, many students have to   out of college because they no longer have the finances to pay for college. By lowering the GPA to 2.5 we give these students a little room to make mistakes and get the feel for a college workload. More students will be able to keep the scholarship this way which will increase the number of college graduates in the state of South Carolina. This would increase the number of functioning members in society these graduates will be paying money to the government rather than receive a check from the government every month. <h3>Section</h3> 4: The benefit from this tax would be:   The number of college dropouts would decrease.   Increase the number of people receiving college degrees and working higher paying jobs.   Fewer people working minimum wage jobs and receiving welfare. <h3>Section</h3> 5: When signed into law, the GPA requirement will go into effect for the 2016-17 schoolyear.","billTitle":"An Act to ban smoking in moving vehicles.","division":"Premier State","governorEvaluation":"not yet evaluated","id":"-K3K51VzmHhva_2l8QZz","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":""},"-K3K59WAdG8vTQPiPsUO":{"author1":"Catelyn Henry","author2":"Hannah Gramann","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: To raise tax on beer and tobacco products in order to benefit post secondary education.  The tax we put on cigarettes and beer is 6%. The tax we put on education in our state is 1% but that only covers education through high school. Currently no tax money goes towards scholarships for colleges and universities. There is no tax on lottery tickets but every lottery ticket sold provides $.261/$1.00 towards a scholarship. If you were to win the lottery 7% of that will go towards state tax and $54.00 implicit tax revenue per capita. <h3>Section</h3> 2: The state tax on beer and tobacco will be increased to 10%. 6% of this will go to tax and the extra 4% will go towards scholarships so, we as a state provide greater educational opportunities to our citizens. <h3>Section</h3> 3: The scholarship money will come from the new percentages we put on tax. Though tobacco and beer products will increase in price, our education will better from it by giving back some of the money we put on those those items and putting them on scholarships. <h3>Section</h3> 4: The increase of this tax will provide the following benefits:   Scholarships to students who might not be able to afford college otherwise.   A more educational work force which will attract more companies to locate in South Carolina. This in turn will provide more high quality jobs for South Carolinians.   The increase in the tax will also help in bringing jobs to South Carolina, because the people will be better educated and have a stronger work ethic. <h3>Section</h3> 5: When passed into the law, the tax increase will go into effect on January 1, 2016.","billTitle":"An Act to Increase The Tax on Alcohol and Tobacco Products","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K59WAdG8vTQPiPsUO","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":" "},"-K3K5SrXnnC0MJ-OrluR":{"author1":"Kaylee Price","author2":"Kaitlyn Broad","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: South Carolina currently does not have a law that enforces the use of  protective headwear (helmet) for all motorcyclists. South Carolina does have a law that  says that motorcyclist under the age of 21 are required to wear protective headwear  but all ages should be required to wear protective headwear. <h3>Section</h3> 2: Enforcing this policy will decrease the number of injuries and fatalities  involved in motorcycle accidents. Helmets decrease the severity of head injuries and  the likelihood of death. The federal government estimates that wearing a helmet  reduces the risk of dying in a crash by 37 percent. Unhelmeted riders are 3 times more  likely than helmeted ones to sustain traumatic brain injuries in the event of a crash  according to the Insurance Institute for Highway Safety. <h3>Section</h3> 3: Wearing protective headwear will reduce the fatality rate in our state. This  policy will protect the motorcyclist and passenger(s). In 2013 motorcycle helmets saved  1,630 lives. NHTSA (National Highway Traffic Safety Administration) says that if all  motorcyclists had worn helmets, 715 more lives would have been saved. Helmets are  estimated to be 37 percent effective in preventing fatal injuries for motorcycle riders  (operators) and 41 percent effective for motorcycle passengers according to the  Insurance Information Institute, Inc. <h3>Section</h3> 4:  Protective headwear will lessen the damage done to the head in motorcycle  accidents by:   Preventing brain trauma   Protecting the skull from being fractured or broken   Preventing spinal cord injuries","billTitle":"An Act to Require the Use of Protective Headwear for Motorcyclist","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5SrXnnC0MJ-OrluR","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Mason King"},"-K3K5TzfsuBEm6vG7JHc":{"author1":"Jack Thompson","author2":"Keegan Mazur","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: The state grading scale would change from its current state to a ten-point  grading scale; for example instead of an A requiring an average of a ninety three or  above, a ninety or above would be required to achieve an A. <h3>Section</h3> 2: This new grading system will significantly reduce the stress that is applied  to South Carolinas students as well as making it easier for new students to transfer  their previous grades from other states. <h3>Section</h3> 3: The Grading Scale would change to:   90-100   80-89   70-79   60-69   0-59 <h3>Section</h3> 4: Students would achieve higher grades and transferring to schools in South Carolina would be easier. Students in this grading scale will also find it easier to achieve a 4.0, seeing as only a ninety is needed to achieve an A or 4.0. <h3>Section</h3> 5: When signed into law, the grading scale will go into effect with the 2016-2017 school year.","billTitle":"An Act to Change the Grading Scale","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5TzfsuBEm6vG7JHc","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Mason King"},"-K3K5UwUHAllHn6ZvtKk":{"author1":"James Kober III","author2":"Kelley Tollison","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: All employed pregnant women in South Carolina would be granted  maternity leave. <h3>Section</h3> 2: Current South Carolina State Human Affairs Law prohibits employment practices that discriminate based on gender, including discrimination dealing with pregnancy, and all medical issues related to it. It states that the employer has to provide the same leave benefits to every employee, no matter their disability. This means that as long as all employees are treated equally, the employer is not technically required to grant maternity leave. There is no law that gives the mother time to recuperate from childbirth. <h3>Section</h3> 3: For the state of South Carolina, maternity leave would be required for all employed women that are with child. The leave would include three weeks before the childs due date, and up to eight weeks after the delivery, depending on the healing rate of the mothers body. <h3>Section</h3> 4: By granting mandatory leave:   Expecting women would not have to work late into their third trimester of pregnancy, decreasing the likelihood of medical issues.   The mothers body would have time to fully heal after childbirth. <h3>Section</h3> 5: When signed into law, maternity leave will begin to be a required policy on January 1, 2016.","billTitle":"An Act to Make Maternity Leave Mandatory In South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5UwUHAllHn6ZvtKk","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Lyndsay Wood"},"-K3K5Vy8iAuzr2j7BL71":{"author1":"Alex Carter","author2":"Trey Stewart","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: In order to obtain a firearm, proof of a psychiatric exam taken within the  last four years must be provided. <h3>Section</h3> 2: The state shall license local psychiatrists to give the examination to  individuals to assess the health of their mind. Citizens shall pay the licensed  psychiatrists to take the examination. <h3>Section</h3> 3: Upon successful completion, the subject shall be presented with a certificate  of health. <h3>Section</h3> 4: The certificate, or copy thereof, will then be required when purchasing a  Firearm. <h3>Section</h3> 5: To be signed into law on January 1, 2016.","billTitle":"An Act to Require Psychiatric Evaluations when Purchasing a Firearm.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5Vy8iAuzr2j7BL71","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Kailey Westmorland"},"-K3K5XMtDIB3BSke5NMi":{"author1":"Elana Otero","author2":"Valentina Hurtado","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1:   Those on welfare in South Carolina will be required to participate in job training in exchange for financial assistance from the state, rather than remaining unemployed. <h3>Section</h3> 2: Unemployment rates at 6% are in need of a decrease, and those taking advantage of financial aid remain unemployed and are still qualifying for welfare and need to be assigned a state job. <h3>Section</h3> 3:    Citizens that are receiving financial aid through welfare, and they remain unemployed would be required to go through a specific job training program   The job training will be provided for a specific occupation chosen by the state in order to benefit the state <h3>Section</h3> 4: Job training programs will:    Decrease the unemployment rate    Fill jobs to benefit South Carolina <h3>Section</h3> 5: When signed into law, the first job training will begin January 1, 2016        SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Require Job Training for Welfare Recipients  BE IT HEREBY ENACTED BY THE YMCA MODEL LEGISLATURE  OF SOUTH CAROLINA  Section 1:   Those on welfare in South Carolina will be required to participate in job training in exchange for financial assistance from the state, rather than remaining unemployed.  Section 2: Unemployment rates at 6% are in need of a decrease, and those taking advantage of financial aid remain unemployed and are still qualifying for welfare and need to be assigned a state job.    Section 3:    Citizens that are receiving financial aid through welfare, and they remain unemployed would be required to go through a specific job training program   The job training will be provided for a specific occupation chosen by the state in order to benefit the state   Section 4: Job training programs will:    Decrease the unemployment rate    Fill jobs to benefit South Carolina   Section 5: When signed into law, the first job training will begin January 1, 2016        SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5XMtDIB3BSke5NMi","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Gunnar Wilson"},"-K3K5sARl4s16AITDSlg":{"author1":"Matthew Alex","author2":"er","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: Owners of South Carolina registered vehicles will be required to participate in semi annual car safety inspections.  These inspections will be enforced by South Carolina Law enforcement and will cost the vehicle owner a fee of $13.60. <h3>Section</h3> 2:  South Carolina is in the top five of states with the most severe              car accidents.  Some safety experts claim that 12 to 33 percent of all car accidents are due to poorly maintained vehicles.  If passed, this bill will help reduce the number of accidents due to poorly maintained vehicles. <h3>Section</h3> 3:  It is estimated that 20,000 car accidents are related to poorly maintained vehicles, car inspections will be available to people at their local automotive repair shops.  New cars will be inspected after the first five years of being driven.  The inspections will take place every two years for cars that have been driven for five years or longer.  Cars that are ten years or older will be inspected every year. <h3>Section</h3> 4:   Revenue from the tax:   A:  Help fund South Carolina education system throughout the state.   B:  Be used to fund the construction of roads throughout the state.   C:  Be used to create Motor Vehicle Repair Shops as required under <h3>Section</h3> 3.  Section 5:  When signed into law, the first inspections will take place on January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to regulate vehicle safety inspections","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5sARl4s16AITDSlg","rocketDocketStatus":"no","school":"Mauldin High School: Mauldin High School","sponsor":"Kate Black"},"-K3K5tf01OpIPN2aPHyi":{"author1":"Rachel Brooks","author2":"Marston Copel","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: To change the education requirements for teachers of grades eight and above, in South Carolina Public Schools <h3>Section</h3> 2: South Carolina:    is 51st on the Education Rankings of States (including District of Columbia)     has and Education policy Grade of C+   High school teachers are only required to have received a Bachelors degree in education, and that is not necessarily in fields they would teach   Students success in school depends essentially on the quality of their teachers, increasing the quality of the teachers would increase the quality of the education received by students. This would eventually would increase South Carolinas placement on the education scale. <h3>Section</h3> 3: Requires all teachers to receive a masters degree in the field they would be teaching. However teachers would also receive a 10% increase in their pay, raising the annual salary to roughly 55,000 dollars per year, due to the rigorous requirements that will become necessary for becoming a teacher. Funding for the pay increase will come from a 2% tax increase on families with a total annual income of $90,000 or more who have children attending the public school system. <h3>Section</h3> 4:  Will create increase in the rigor of the education requirements to become a teacher. This bill should attract higher quality teachers to promote the field of education. <h3>Section</h3> 5:  When signed into law, the bill will go into effect on January 1, 2016. SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Improve Education","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5tf01OpIPN2aPHyi","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Kailey Grooms"},"-K3K5zqNx8F0b5eEQ3Bs":{"author1":"Emily Marshbanks","author2":"Summey Ferrell","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current South Carolina school systems require children attending such schools to get generic vaccines shots like Hepatitis B, Mumps, and Tetanus.  This act will require all students to get the Flu vaccine shot. <h3>Section</h3> 2: Requiring school children to be vaccinated for the flu will reduce flu related illness in children and adults. A recent study showed the flu vaccine reduced childrens risk of flu-related pediatric intensive care admission by 74%. Flu vaccination is associated with a 71% reduction in flu related hospitalizations for adults of all ages. <h3>Section</h3> 3: Individuals may receive their flu shot through their primary care physician or at a D.H.E.C. clinic. Any family that has an annual income at or below the national poverty guideline will receive the vaccination free of charge at any D.H.E.C. clinic. All others will pay out of pocket or through their insurance plan. <h3>Section</h3> 4: Results of students getting the vaccine would include:   Cleaner and more sanitary South Carolina schools.   Decrease of flu cases in the state of South Carolina.   Lowers the risk of infection for everyone, including teachers, students, students, and administrations.   Decreased loss of instructional time due to illness. <h3>Section</h3> 5: When signed into law the vaccine will be required for all children from kindergarten to the twelfth grade beginning with the 2017-2018 school year.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to require students to get the flu vaccine","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K5zqNx8F0b5eEQ3Bs","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Kalynn Benoit"},"-K3K6ILPuVJjIPRHtbhf":{"author1":"Leah Hovell","author2":"Megan Wait","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Any citizen or permanent resident with health insurance who visits a doctor before the fourth month of their pregnancy is eligible to receive a maternity package from the state. These packages will be funded under the social security administration, specifically through revenue made off a football bowl game hosted in Columbia, SC. The production and assembly of the packages will produce jobs, as they will be updated annually to allow recognition and create community among women with children born during the same year. <h3>Section</h3> 2: All the items are necessary for a mother to take proper care of the infant during the first few weeks of its life. The package promotes prenatal checkups as the mother will have to visit a doctor to receive the package. It encourages breast feeding and environmental awareness by using sustainable materials such as the cloth diaper. It also encourages mothers return more quickly to activities they enjoyed prior to the arrival of their newborn. Countries with similar programs have seen a dramatic decrease in infant mortality rates. The package serves as a parents first promise to their child, as well as one from the state to the parent, that they want their child to have a good life. <h3>Section</h3> 3: The Maternity package will be a lined box with a lid made out of recycled materials, the box will double as a crib. It will contain the following items: Mattress, mattress cover, duvet cover, two gender neutral bodysuits for each season, a hooded bath towel, toothbrush, baby thermometer, diaper cream, washcloth, baby soap, cloth diaper, teething toy, picture book, three letter word book, world map, one bottle, one pacifier, a swaddle blanket, and a carry sling. <h3>Section</h3> 4: When signed into law the packages will start being disrupted beginning January 1, 2016.     SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"A BILL TO PROVIDE ASSISTANCE FOR MOTHERS","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K6ILPuVJjIPRHtbhf","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Hampton Randall"},"-K3K6K0qy29P8frX5DEP":{"author1":"Madison Barefoot","author2":"Caroline Weldon","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current financial literacy requirements found in the Economics curriculum would be expanded to include skills students need to prepare them for life after graduation or college. <h3>Section</h3> 2: Students will need knowledge to help them prepare for adulthood, such as how to file taxes and manage credit card accounts. <h3>Section</h3> 3:  With the expanded curriculum, students will learn how to file taxes, manage credit card accounts, write a job resume, apply for and pay off student loans, save and invest, manage debt, manage insurance, balance a checkbook, and calculate interest. They will also be taught how to better live independently with skills such as how to cook a basic meal, change a tire, basic first aid knowledge, and how to keep a clean and organized home. This will prepare students for when they are of legal age to be independent of their parent or legal guardian. <h3>Section</h3> 4:  This extended curriculum would:   Prepare students for life after graduation.   Demonstrate how to maintain a successful household.    Demonstrate how to manage ones personal finances. <h3>Section</h3> 5:  When signed into law, the new requirements will go into effect on January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to prepare high school students for life after graduation","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K6K0qy29P8frX5DEP","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Genin Howard"},"-K3K6LXRdvazU6njGBBW":{"author1":"Demetri Coundoussias","author2":"Adam Green","authorLocation":"not yet assigned","billLocation":"PA","billStatus":"on the docket","billText":"<h3>Section</h3>1: Any incorporated company or LLC (limited liability Company) will receive a tax break for that fiscal year for hiring a certain number of employees who were interning at that company. <h3>Section</h3> 2: Companies will receive a 2% tax break for meeting the requirements of this law. <h3>Section</h3> 3: The interns must be unpaid while interning and must intern for at least 2 months at the company. <h3>Section</h3> 4: The number of newly hired employees who had been interns must be equivalent to at least 2% of the total workforce of that company that works in South Carolina. <h3>Section</h3> 5: The Company must keep these new employees for at least 1 year unless there is reason to fire the employee in order to prevent companies from abusing this law in order to get the tax break.      The employee must adhere to the policies of the company    The employee must receive the average minimum pay for their position. <h3>Section</h3> 6: This bill will take effect on January 1, 2016  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Increase Job Creation","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K6LXRdvazU6njGBBW","rocketDocketStatus":"no","school":"St Josephs Catholic School","sponsor":""},"-K3K6SVUCvUFzcVPfzU6":{"author1":"Holly Edenfield","author2":"Dessa Jones","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state law states that students must have a physical education credit or play two years of a school sport before graduating high school that would be changed to being able to count out of school sports as a physical education credit if they play that sport for at least 8 to 14 hours a week to earn the credit, students could also play a sport for 15 or more hours a week and earn the credit in just one year. <h3>Section</h3> 2: Playing an out of school sport for four hours a week over the course of two years would count towards one physical education credit for graduation. Playing more hours a week or more years would add to the number of credits received. <h3>Section</h3> 3: A form would be created and must be signed by the coach, legal guardian, principal of the school, and student to log the number of hours spent practicing and playing and must be turned in to the coach of the sport in the school to receive the credit(s). Coaches will sign as the student logs their hours to insure honest times. <h3>Section</h3> 4: The number of hours practiced and played in games would have to be equivalent to or more than the number of hours students take in two years of school sports or a semester of gym. <h3>Section</h3> 5: The students must play at least 8 - 14 hours a week of one sport or play more than one out of school sport. They could also play in between 15 and 25 hours a week a get their gym credit in one year. <h3>Section</h3> 6: This law would take effect at the beginning of the 2016-17 school year SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Allow Out of School Sports to Count for Graduation Credits","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K6SVUCvUFzcVPfzU6","rocketDocketStatus":"no","school":"St. Josephs Catholic School","sponsor":"Luke Bynum"},"-K3K6TO1dGlhjAvunXls":{"author1":"Michael Lynch","author2":"Maegan White","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1:   In South Carolina, people accused of felony crimes must go before a grand jury. Evidence is presented to the grand jury inquiring if there is enough evidence to go to trial. In South Carolina grand jury hearings evidence is not transcribed by the court. <h3>Section</h3> 2: South Carolina courts will begin to transcribe all grand jury hearings. This would allow records of Grand Jury hearings to be presented into evidence during a trial and present to the Grand Jury during the deliberation, the process in which the jury decides if enough evidence is provided to go to a trial. <h3>Section</h3> 3:         It will act as a deterrent against potential abuse of the Grand Jury system. It will ensure fair treatment and equal court rights to every citizen. It will streamline the hearing and trial process. Finally this law will primarily illimitable the rubber stamp process, which is the ratification and indictments of cases without proper consideration. <h3>Section</h3> 4:       Records represent hard evidence that protects the integrity of the hearing process in which it is important that fair determination be made on the charged individual. <h3>Section</h3> 5:       When signed into law, the first hearing to be transcribed will take place on January 1, 2016.    SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act To Transcribe Grand Jury Hearings","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K6TO1dGlhjAvunXls","rocketDocketStatus":"no","school":"St. Josephs Catholic School","sponsor":"Zac Palmer"},"-K3K6iBumbsUssElNtW1":{"author1":"Alaina Hrysikos","author2":"Amy Murphy","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current lack of ban placed on Personal Vaporizers and Electronic Cigarettes will be replaced with restrictions of use of these products. <h3>Section</h3> 2: The state ban will eliminate use of Personal Vaporizers and Electronic Cigarettes within 10 feet of any public or commercial building. <h3>Section</h3> 3: Because Personal Vaporizers and Electronic Cigarettes are suspected to be harmful due to the suspected carcinogenic chemicals, formaldehyde and acetaldehyde produced from the heating of the propylene and glycol, the ban would reduce the spread of these chemicals to those who do not vape. <h3>Section</h3> 4: Effects from this ban would include: A. The reduction of suspected carcinogenic chemicals exposed to nonvaping peoples and children. B. The possible overall reduction of vaping C. The possible reduction of under-age youth obtaining Personal Vaporizers and Electronic Cigarettes. <h3>Section</h3> 5: When signed into law, the ban will take place on January 1, 2016.SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"Vape is Life Until it Takes Your Life  An Act to ban the use of Personal Vaporizers and Electronic Cigarettes in public and commercial buildings","division":"Senate","governorEvaluation":"not yet evaluated","id":"-K3K6iBumbsUssElNtW1","rocketDocketStatus":"no","school":"Spartanburg High School","sponsor":""},"-K3K6jYwCnaZWI3YVoZL":{"author1":"Nan Miles","author2":"Ashley Wade","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently in South Carolina, laws do not require motorcyclists to wear helmets while on the road. <h3>Section</h3> 2: This law passed will make it mandatory for all motorcyclists to wear helmets while riding motorcycles on the road. <h3>Section</h3> 3: If motorcyclists do not heed this law, they will be fined a minimum of $50. <h3>Section</h3> 4: This law will be enforced by highway and city police, who will have the right to stop any motorcyclist seen without a helmet, and ticket them accordingly. <h3>Section</h3> 5: The revenue collected through the fines will fund advertisement of motorcycle safety, in the form of billboards, flyers, and a government program that would travel throughout the state, educating schools and the public on motorcycle safety. <h3>Section</h3> 6: When signed into law, this bill will go into effect January 1, 2015. SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Require Motorcyclists to Wear Helmets","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K6jYwCnaZWI3YVoZL","rocketDocketStatus":"no","school":"Spartanburg High School","sponsor":""},"-K3K6krwjwyiE7girtyO":{"author1":"Harrison Carmichael","author2":"Walker Gillespie","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: It is currently illegal to fight in public in the state of South Carolina and it will become legal to fight in public. <h3>Section</h3> 2: This change will be implemented county by county until it is legal in the whole state on January 1, 2016 <h3>Section</h3> 3: This change will elevate tensions and create a more civilized state. <h3>Section</h3> 4: Benefits of this bill include but are not limited to A. Increased self-defense skills for the general public; B. A tougher population who can effectively defend themselves will evolve; C. Creates a simple and effective method of solving problems between any two parties. <h3>Section</h3> 5: When signed into law, this bill will take place on January 1, 2016. SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Legalize Public Fighting","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K6krwjwyiE7girtyO","rocketDocketStatus":"no","school":"Spartanburg High School","sponsor":""},"-K3K7hqAdYAR89i32M0G":{"author1":"Drew Nichols","author2":"Alec DiBattista","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current income tax of 3% to 7% would be eliminated. <h3>Section</h3> 2: The point of this bill is to attract people and businesses to South Carolina and also to help residents of South Caroline keep their money that they earned. <h3>Section</h3> 3: With state income tax eliminated, sales tax would change from 6% to 7%. The upper class people who make more money will still spend their money on luxury items allowing the state government to still get their money lost from income tax. There would be no sales tax on food so the new bill doesnt not put a bigger burden on the lower class. <h3>Section</h3> 4: Elimination of this tax would cause: <h3>Section</h3> 1: More businesses and more people would move to South Carolina creating  more jobs; <h3>Section</h3> 2: More money in peoples pockets; <h3>Section</h3> 3: More people have money to spend which helps businesses. <h3>Section</h3> 5: When signed into law, elimination will begin on January 1, 2017  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Eliminate State Income Tax","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K7hqAdYAR89i32M0G","rocketDocketStatus":"no","school":"Greenville Technical Charter High School","sponsor":"None"},"-K3K7oC7mInvBz6OsTbs":{"author1":"Haley Stambaugh","author2":"Abby Robinson","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Attendance to after-school tutoring on Tuesdays and Thursdays is low due to lack of student motivation. If food was provided to students in attendance, there would be an increase in the amount of students attending. <h3>Section</h3> 2:  If food is provided at after-school tutoring programs, more students would be motivated to attend. The food would be provided by PTSA, restaurant donations, and meals prepared by parent volunteers. <h3>Section</h3> 3:  If food was provided, then attendance would increase and attract students to get help with school work. This will also help to give students who dont have the opportunity to eat dinner at home a chance to eat. It will also increase grades because it would be an incentive to get help to improve their grades and study abilities. <h3>Section</h3> 4:  The results of providing food during tutoring include:    Improving the averages of students and increasing GPAs, SAT and ACT scores   Encouraging a higher success rate when entering college due to acquiring the abilities to learn new study habits   As a bonus, this law also provides free meals to kids who might not have the option of evening dinner at home <h3>Section</h3> 5: When signed into law, tutoring sessions will supply food beginning in the 2016-2017 school year.   SOUTH CAROLINA YOUTH IN GOVERNMENT28th Annual Model Legislature November 18th-21st","billTitle":"An Act to Encourage After-School Tutoring","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K7oC7mInvBz6OsTbs","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K7tXGT26A-P1MB9pk":{"author1":"Megan Muise","author2":"Giovanna Vasquez","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>I: The current state of physician assisted death is currently not legally active and would be altered to be legal for terminally ill patients who are mentally competent with a shortened life span. <h3>Section</h3> II: The number of citizens who were terminally ill and suffering would have the option of dying. At this point in time only five states have a law allowing physician assisted death. In 2013, 0.21% of all deaths were in Oregon were due to the Death with Dignity Act. 22% of patients who died between 1998 and 2002 by assisted death in Oregon were in pain or afraid of being in pain, according to their doctors. <h3>Section</h3> III: Because of the number of people suffering from a terminally painful illness each year, the option of assisted death will be offered to those who are mentally competent with six months or less to live. <h3>Section</h3> IV: The assisted death technique will:   provides the terminally ill to control their death.   save a loved one who has been asked to help end the suffering from potential prosecution and jail time. <h3>Section</h3> V: When signed into law, the legalization of physicians assisted death will take place on January 1st, 2016.   SOUTH CAROLINA YOUTH IN GOVERNMENT28th Annual Model Legislature November 18th-21st","billTitle":"An Act to Assisted Death Section","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K7tXGT26A-P1MB9pk","rocketDocketStatus":"no","school":"Wade Hampton","sponsor":""},"-K3K8-LP3jw14ff4HCLG":{"author1":"Julie Madeline","author2":"Olivia Balkcum","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>l: Students will be able to get their homework completed or almost completed and turned in on t time. <h3>Section</h3> II: Students without study hall don't have the same opportunities than people with study halls. Accord i ng to LA times, on average high school students are assigned 3.5 hours of homework a week.night, or more than  17 hours a week. Eliminating almost an hour from this s wou ld increase se the student 's hom ework grade and i n turn, overall l l grade.   Students are set back on school work because jobs , sports, and extra-curricular activities. Having a study hall will take stress off the student and allow them a specific amount of time to complete some of thei r school work. <h3>Section</h3> ill: lf students had a mandatory study hall we would ha ve the same chance to excel. Having an extra forty minu tes during school wou ld decrease the amount of studen ts not doing homework. <h3>Section</h3> IV: If students had a mandatory study hal l du ri ng school hours i t would :    Increase se their grade average and homework tum in.   Students would be more focused and organized with their school work.   It would give students more ti me to finish thei r homework before sports so they can get to bed at an earlier time. <h3>Section</h3> V: lt will become effective at the beginning g of the next school year, 2016.   SOUTH CAROLINA YOUTH IN GOVERNMENT28th Annual Model Legislature November 18th-21st","billTitle":"An act to mandatory study hall","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K8-LP3jw14ff4HCLG","rocketDocketStatus":"no","school":"Wade Hampton","sponsor":""},"-K3K8bIIyUvZotCS-FqT":{"author1":"Sydney Cornwell","author2":"Margaret Shaughnessy","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current fine for text-based communications such as texting and emailing while driving in South Carolina is 25 dollars for first time offenders. Distracted driving does not include talking on the phone. <h3>Section</h3> 2:  Legislation will be passed and a law will be enacted to make texting and driving a traffic violation in the state of South Carolina which will carry heavy penalties for offenders. The first offense for texting and driving will result in a $100 fine. The second will result in a $200 fine and the third offense will result in a suspended license for three months. Anything after a third offense will result in a suspended license for six months. <h3>Section</h3> 3: Most states in the United States prohibit texting and driving. In Connecticut, when caught texting and driving, the first offense is a 125 dollar fine; the second offense is a 250 dollar fine. In Georgia, offenders are fined 150 dollars and one point is taken from their license when caught texting and driving. <h3>Section</h3> 4:  Revenue from this tax would fund:   A.   Driving education for old and new drivers, along with driver safety training. B.   Road improvements <h3>Section</h3> 5: The texting and driving law will be put into effect January 1, 2017.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 10th Annual Model Legislature November 19th21nd","billTitle":"An Act to Raise the Fine for Texting and Driving in South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K8bIIyUvZotCS-FqT","rocketDocketStatus":"no","school":"Greenville High School","sponsor":"Representative Jack Young"},"-K3K8ui3mJeBmpO_JunO":{"author1":"Myddie Parker","author2":"Annabelle Davis","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Currently the law in South Carolina is that we allow schools to have epinephrine on hand.  In the 20162017 school year South Carolinas public schools will be required to have epinephrine on hand in case of an emergency. <h3>Section</h3> 2:  A person can go into anaphylaxis within minutes from exposure to an allergen.  If epinephrine is not in quick reach, the person's life could be in danger. <h3>Section</h3> 3:  The fastest way to administer epinephrine is through an EpiPen. This bill would require all South Carolinas public schools to have one EpiPen per school.  On average these EpiPens are $100. We would require the individual schools to put the $100 in the schools budget to provide the money for the EpiPens. <h3>Section</h3> 4:  On average this disease affects 1 in every 13 children under the age of 18 in the United States. That is roughly 2 people in every classroom. Requiring all South Carolina public schools to have an EpiPen on hand can save many children's lives. <h3>Section</h3> 5:  When signed into law this will take place on the 20162017 school year.      SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Require All South Carolina Schools to have Epinephrine on Hand for Emergencies","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K8ui3mJeBmpO_JunO","rocketDocketStatus":"no","school":"Greenville High Academy","sponsor":"None"},"-K3K8wDu96_0AHJgiS3J":{"author1":"Kennedy Perry","author2":"Emma Miller","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently, farmers are not required to disclose which pesticides and herbicides they are using to encourage crop growth. <h3>Section</h3> 2:  If people continue to ingest these chemicals without knowing what kind of chemicals are currently in use, then they could become ill or suffer significant damage to their body. <h3>Section</h3> 3:  If passed, this bill will require farmers/crop growers to disclose the chemicals they use, enabling people to make better decisions about their food choices. This would be very similar to the way manufacturers list ingredients on their food packages. <h3>Section</h3> 4:  This would address the following concerns.      A lack of factual information about what chemicals were used in producing food    Discouraging people from purchasing non-organic foods    Promoting awareness of harmful chemicals people are exposed to in their food. <h3>Section</h3> 5: When signed into law, this bill will take effect on January 1, 2016.    SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"What Chemicals Are Farmers Using?","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K8wDu96_0AHJgiS3J","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K9-AsfvuG1yKrj0ED":{"author1":"John Lawler","author2":"Grayson Walker","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1: Rhode Island as a state has contributed next to nothing to the whole of the United States, and even less so to the state of South Carolina. Rhode Islands size is insignificant, theyve done nothing of historical importance, and they refused to send delegates to the Constitutional Convention  noting this, it is certain that few people would notice or complain about its disappearance. Considering our failing infrastructure and increasingly patchy roads, the state is in dire need of an improved infrastructure. Rhode Island, being a fairly useless area and already bearing the name Rhode, would be an incredibly useful site for manufacturing road-building material for the state of South Carolina. Therefore, it will be decreed that the state of Rhode Island will be annexed to South Carolina. <h3>Section</h3> 2:  Following the annexation of Rhode Island by South Carolina, immediate destruction of all sources and documents referring to Rhode Island as ever having been an independent state will be decreed. All traces of Rhode Island as an independent state will be eliminated, and all former Rhode Islanders will be sent to psychological rehabilitation centers until they profess that there was never a state known as Rhode Island. The treachery of Rhode Islands failure to send delegates to the Constitutional Convention in 1787 will be avenged. <h3>Section</h3> 3:  After full control over Rhode Island is realized, funds will immediately be redirected from unemployment subsidies to the purchasing of material for road construction. <h3>Section</h3> 4:  All houses and public buildings in the former state of Rhode Island will be bulldozed and cleared for the construction of massive industrial factories to produce asphalt and paint for road construction. <h3>Section</h3> 5:  Once the aforementioned prerequisites are sufficiently met, construction on road paving factories will immediately begin. <h3>Section</h3> 6: The new, intensified asphalt production will mean a subsequent drop in costs for asphalt manufacturing, thereby making the repaving of our roads significantly cheaper and more efficient and would result in the establishment of asphalt production and road-paving as one of South Carolinas largest industries (which, consequently, will mean thousands of new jobs for those out of work). <h3>Section</h3> 7: Upon the governors signature, this bill will become law on January 1st, 2016.   SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"A Proposition to Cede the Territory of the State of Rhode Island to South Carolina and Convert it into a Province For Road Material Manufacturing for the State of South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K9-AsfvuG1yKrj0ED","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K9-w_G-9wWOSx_al5":{"author1":"John Daniel","author2":"Zach Pace","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state grading scale states that an A constitutes 100-93%, a B constitutes 92-85%, a C constitutes 84-77%, a D constitutes 76-70%, and an F is defined as any grade below 70%. The grading scale will be changed to a ten-point grading scale in which an A will be defined as 100-90% and a B will be defined as 89-80%. <h3>Section</h3> 2:  The state grading scale will change to a ten-point grading scale in order to match the other 48 states and allow more accurate comparison. <h3>Section</h3> 3:  Because students in the other states have an unfair advantage over our South Carolinian students, they have a better chance to be accepted into better colleges. This bill will even the playing field for South Carolina students. <h3>Section</h3> 4:  The ten-point scale will also make South Carolina students GPAs appear higher and make these students more appealing to prestigious colleges. Even with high grades, South Carolina students GPAs do not seem as high. But the ten-point scale will correct this discrepancy between the states. <h3>Section</h3> 5: When signed into law, this bill will takeClear formatting and concise descriptions make for better debate and clearer                understanding! Clear formatting and concise descriptions make for better debate and clearer                understanding!  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Alter the Grading Scale","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K9-w_G-9wWOSx_al5","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K9En5n0qm9kLdXogQ":{"author1":"Ali Timms","author2":"Anne Marie Faris","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current state requirement for after school education for lower and middle school would increase from no minimum to a minimum of 3 hours per week per student during the school session/year. <h3>Section</h3> 2: The requirement of 3 hours per week per student would be implemented immediately and for a 5 year period. <h3>Section</h3> 3: Because an educational requirement such as this would require the school district budget to increase the property tax will be increased by .01 per 1000$ of home value in the school district. <h3>Section</h3> 4: Revenue from this property tax would fund:    The teachers for the after school programming   Educational supplies needed to support the educational programming    Transportation to field trip educational opportunities <h3>Section</h3> 5: When signed into law, the first increase will take place on January 1, 2016. SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"Expand Educational Exposure  An Act to increase after school activities for Lower and Middle age students for the purposes of expanding educational exposure","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K9En5n0qm9kLdXogQ","rocketDocketStatus":"no","school":"Christ Church Episcopal","sponsor":"Representative Jack Young"},"-K3K9PjwQ5VxiHVtDY7z":{"author1":"Naomi Delgado-Sanchez","author2":"Fatima Gonzalez","authorLocation":"not yet assigned","billLocation":"ASSIGN","billStatus":"on the docket","billText":"<h3>Section</h3>1: Currently in South Carolina, there is no requirement for pull-behind trailers, mopeds, and bicycles to be registered for a license plate. If the state made it a requirement the fees would be used for the purpose of repairing roads. <h3>Section</h3> 2:  All pull-behind trailers, mopeds, and bicycles ridden on the state, county, or city roads would be required to be registered and have a license plate in the state of South Carolina except within residential subdivision and private property. <h3>Section</h3> 3:  Currently in South Carolina, roads and bridges are degraded and need to be repaired. The taxes collected would be used to repair the roads. <h3>Section</h3> 4:  When signed into law, the first increase will take place on January 1, 2016.   SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28TH Annual Model Legislature November 18th-21st","billTitle":"An Act to Fix Roads in South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K9PjwQ5VxiHVtDY7z","rocketDocketStatus":"no","school":"Eastside High School","sponsor":" "},"-K3K9_aT554Gc5Q46EG7":{"author1":"Meredith Hovart","author2":"MC Crawford","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: Current South Carolina sales tax ranges from 6% to 8%. We propose an increase in the sales tax to 10% on all cigarette sales in South Carolina. <h3>Section</h3> 2: The tax will go into effect January 1st 2016. Money gained over the course of a year will begin to be distributed in the spring of 2017. <h3>Section</h3> 3:  Section 4: The money will come from the sales of cigarettes. The money will go to the South Carolina Department of Alcohol and Other Drug Abuse Services (DAODAS). They provide treatment and intervention for drug users of all ages in South Carolina. The DAODAS also provides services to prevent people of all ages from getting involved with drugs. Currently the DAODAS only receives 30% of their funding from the South Carolina government. We hope to raise that number to 45%. <h3>Section</h3> 6: When signed into law, the first increase will take place January 1st, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"Tax on Cigarettes for Rehab Facilities  An act to increase the tax on cigarettes sold in South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K9_aT554Gc5Q46EG7","rocketDocketStatus":"no","school":"Christ Church Episcopal","sponsor":""},"-K3K9hXI8D-iFEcU5fTE":{"author1":"Alexa Kabas","author2":"Catherine Hollis","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: Many children are struggling from social and sensory details, even at such a young age. Recent studies show that children have been more recently diagnosed with ADHD. Some studies show that children are more likely to develop ADHD from the amount of time they are forced to sit still during school. <h3>Section</h3> 2: A resolution to this problem would be to give children a longer play time. Recess enables children to develop certain life skills, like communication and teamwork, that contribute to the fundamentals of having good social skills. <h3>Section</h3> 3: Children need to have whole-body sensory experiences on a daily basis in order to develop strong bodies and minds. A preschool teacher observed her classes, and noticed that many children would fall out of their seats over three times a day, from being restless. Also children would run into walls and each other. To provide more recess, it would allow children to develop better social skills, a decreased chance of being diagnosed with ADHD, and no more children falling out of chairs, which teaches kids how to improve their focus and have a reduce in cognitive issues. <h3>Section</h3> 4: Benefits of this bill would include:   Children would start their academic years with an advantage and will not be as clumsy, be more attentive and alert, more emotionally stable, and more socially competent.   Having more playtime will also prevent cognitive and sensory issues later on in childhood.   Prevents issues such as ADHD.   It does not require a huge amount of money to allow more time for children in their preschool years to play more, but still have time to learn. <h3>Section</h3> 5: When signed into law, the changes in schedule will take place on the first school day of the new year.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"Preschool Play Time  Why children can't sit still during school","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K9hXI8D-iFEcU5fTE","rocketDocketStatus":"no","school":"Christ Church Episcopal School","sponsor":"Matt Jacobsson and John Byrnes"},"-K3K9jihfiOAhWFvD5ru":{"author1":"Emilee Daniel","author2":"Molly McConnell","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1:  In recent years there has been a rising number of gun related situations in schools. <h3>Section</h3> 2: To increase student safety we move to require all faculty members employed in private and public schools to take part in state certified self-defense classes specializing in defense against assailants possessing firearms, and how to respond to hostage situations. <h3>Section</h3> 3: The required course would entail:    Basic defense skills for themselves and others.   How to compose themselves and relay directions to the at risk students in the event that they are threatened.   How to respond in the event of a threatening gunmen.   First-aid training <h3>Section</h3> 4: We will raise the property tax by 0.5% in order to fund these self defense training classes for all educators. <h3>Section</h3> 5: When signed into law, this bill will take effect for the 2016-2017 school year.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Train All Teachers in Defense Against Gunmen","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3K9jihfiOAhWFvD5ru","rocketDocketStatus":"no","school":"NEXT High School","sponsor":" "},"-K3KAL4IeaBEPWty0ddo":{"author1":"Lucy Manley","author2":"Hannah White","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: Department of Social Services (DSS) can remove a child from parental custody when a child is in physical or emotional danger. <h3>Section</h3> 2:  After a child is removed from parental custody, and the family does not take the steps necessary to regain custody within six months, parental rights will be gradually terminated. <h3>Section</h3> 3: The steps that a parent should begin taking within the first 6 months of DSS taking their child into legal custody consist of the following:    Drug Test   Provision of adequate housing inspected by DSS    Employment held for 6 months at min. <h3>Section</h3> 4: The following steps will be taken in order to terminate parental custody:      The parent(s) will no longer be the legal guardian(s) of the child.    The parent(s) visitation rights will be revoked.   The parent(s) will no longer have custody or visitation rights. <h3>Section</h3> 5: The steps listed in <h3>Section</h3> 4 take place at the discretion of a DSS  case team after the initial six month period. <h3>Section</h3> 6: If all of the actions in <h3>Section</h3> 4 are implemented, the parent(s) must  wait a minimum of two years before reapplying for visitation rights. <h3>Section</h3> 7: When signed into law, these regulations will begin to apply to families  after January 1, 2016. SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Allow for Gradual Termination of Parental Rights in Cases Where Parents Fail to Meet Custodial Requirements","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KAL4IeaBEPWty0ddo","rocketDocketStatus":"no","school":"NEXT High School","sponsor":"Nobody"},"-K3KASj8TDDVs-JO15Pb":{"author1":"Emma Maggio","author2":"Emily Hefty","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1:  The current income tax is 10% - 15% for single incomes under $37,000. <h3>Section</h3> 2: This bill would reduce a minors (under 18) income tax to 7%. <h3>Section</h3> 3: If minors have jobs they make very little money, and they still have to pay taxes. Minors have to pay taxes even though they dont have the same privileges, such as the ability to vote. <h3>Section</h3> 4: 5% of the tax would go to the government and 2% would go to a savings account for the minor. The minor would have access to this account at the age of 18. <h3>Section</h3> 4: When signed into law, the first increase will take place on  January 1, 2016 SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Reduce the Income Tax on Minors with Jobs","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KASj8TDDVs-JO15Pb","rocketDocketStatus":"no","school":"NEXT High School","sponsor":" "},"-K3KAUBPYm7EtVMtEyjd":{"author1":"Dayton Meetze","author2":"John Haynes","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: Statutory rape is the act of consensual intercourse with someone who is not above age and someone who is the age of consent. The Mistake of Age law states that if the person accused of statutory rape was lead to believe that the victim was above the age of consent, that the defense can use this in trial. Several states have already taken the initiative to make the Mistake of Age defense, legal for the defense to use. <h3>Section</h3> 2: As of October 2015, it is illegal to you the Mistake of Age law as a defense in court in regards to statutory rape charges in South Carolina. The law states that if the defendant was led to believe that the victim was the age of consent, which is 16 in South Carolina, then the law can be applied. If the person being accused of statutory rape was led to believe that the victim was of age, then the law can be applied as long as there is sufficient evidence to support this claim. <h3>Section</h3> 3: The Mistake of Age law has certain regulations and guidelines that must be followed/reviewed.    Jurors will be given access to social media of the victim and messages between the accused and the victim. They will then decide whether or not the victim can be seen as someone who is of age, or older based on the evidence given to them.   Not only will they have access to the victim's social media and messages, but also the person being accused. After reviewing both pieces of evidence, the jury will decide from there.    After looking at the evidence, 8 out of the 12 grand jurors would decide whether or not charges will be brought forth or can be used in the case against the victim.   This law only applies to the accused if they are under the age of 30. <h3>Section</h3> 4: When signed into law, the defense will be allowed in cases after January 1, 2016.   SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Legalize the Mistake of Age Defense Pertaining to Statutory Rape","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KAUBPYm7EtVMtEyjd","rocketDocketStatus":"no","school":"NEXT High School","sponsor":" "},"-K3KAV4WxX8gaXeeKRur":{"author1":"Peter Sherer, Braeden Thompson,","author2":"Sami Dawson","authorLocation":"not yet assigned","billLocation":"PB","billStatus":"on the docket","billText":"<h3>Section</h3>1: Farmers growing Organic Foods in South Carolina will be provided a tax break on 25% of their crops. <h3>Section</h3> 2: The tax break will encourage farmers to grow organic crops instead of genetically modified crops. GMO stands for Genetically Modified Organisms. GMOs can be harmful in many ways. Some of which include: organ damage, infertility, immune system disorders, and accelerated aging. 80% of groceries contain GMOs, and around 90% of all corn and soy crops are genetically modified. <h3>Section</h3> 3: The tax break will also reduce the price of crops being sold and encourage consumers to purchase organic foods; therefore increasing the profit of the farmer. <h3>Section</h3> 4: When signed into law, the first tax break will affect crops planted and harvested after January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Establish a Tax Break for Farmers Growing Organic Foods","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KAV4WxX8gaXeeKRur","rocketDocketStatus":"no","school":"NEXT High School","sponsor":" "},"-K3KAVslqgGYV2VukX2R":{"author1":"Dmachia Milom","author2":"Jamyia","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: Colleges should provide funds to pay for housing, books, and a meal plan. According to the College Board, the average cost of tuition and fees for the 20142015 school year was$31,231at private colleges,$9,139for state residents at public colleges, and$22,958for out-of-state residents attending public universities. Student debt in the US has reached $1.3 trillion and rising. <h3>Section</h3> 2: The United States is losing well-educated students because of rising costs. Because of reduced costs in Europe, more than 4,600 US students are fully enrolled at Germany universities, an increase of 20%. These fees include $120 in fees and health insurance. American students are leaving the country just to go to a college where they know they will not end up in outrageous debt. <h3>Section</h3> 3: The US wants everyone to have education, but not everyone has the money. Even if they do, when students off to college, they get in debt. If families cannot pay tuition, many intelligent and capable students will have to forfeit their education. <h3>Section</h3> 4: I think the US should pass a law that colleges should be free, or maybe lower the prices A LOT and so the professors and anyone who works at a college would still get paid. I think if they lower the prices then more people would come to college and that would help. We should look to Germany for an example. If the US had fair college prices maybe more people from out of the country would come to school here.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"A Bill to Reduce Prices of College","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KAVslqgGYV2VukX2R","rocketDocketStatus":"no","school":"Legacy Charter","sponsor":" "},"-K3KA_QIedXzCJNpJnVx":{"author1":"Emani Dawkins","author2":"Kayla Gomez","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1: Marijuana refers to dried leaves, flowers, stems and seeds from hemp plant, cannabis sativa. Marijuana is usually smoked. Some users also mix marijuana into food or use it to brew tea. <h3>Section</h3> 2: Marijuana should be legalized for medical purposes, such as chronic pain from cancer or migraines, anxiety, epilepsy, and/or stress. <h3>Section</h3> 3: With permission from a doctor, a patient will receive a card. When you get this card, you will be put on a list that will allow you to buy marijuana from an authorized seller called a dispensary. Patients will receive the cannabis by going to the doctor and depending on the case, they will be prescribed medical marijuana to relieve the stress. This drug is the best treatment for his overwhelming pain. <h3>Section</h3> 4: Within five minutes of smoking marijuana, the spasms have gone away and the chronic pain is in the process of leaving your body. A couple intakes of marijuana a day helps people with chronic nerve pain feel less pain and sleep better at night. <h3>Section</h3> 5: Medical marijuana is more expensive that street marijuana. For 28.5 grams of cannabis, you would have to pay $100. It is highly important that the medical marijuana is legalized in different states. It is already legalized in states including Washington, Colorado, and California.   SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"A Bill to Legalize the Use of Medical Marijuana","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KA_QIedXzCJNpJnVx","rocketDocketStatus":"no","school":"Legacy Charter","sponsor":" "},"-K3KAgDOwwCEo3mtuvNA":{"author1":"Shakayla Gill, Sarah Burns,","author2":"Brooke Hudson","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Drivers above the age of 50 should be required to take a driving test every five years in the United States. <h3>Section</h3> 2: Failure to comply while continuing to operate a vehicle will result in the persons license being revoked along with the charge of a fine to be determined by a judge in a court of law. Failure to pay said fine within a thirty day period will result in additional fees. If it can be proven that the understood what they were doing and that their actions posed a risk of causing harm, the defendant may be charged for reckless endangerment. <h3>Section</h3> 3: Supporting statistics and facts to consider:   As people age, they tend to take more medications which could potentially affect their ability to drive safely.    Several health issues associated with old age can impair driving abilities, such as:   Arthritis, which could affect a persons ability to make quick and sudden movements.   Dementia and Alzheimer's, which could increase the chance of common driving laws being broken along with a higher risk of injuring themselves in car accidents/malfunctions.   Parkinsons Disease, which affects a persons movement.    Shrinking of height, which could prevent the person from being able to see everything they need to. <h3>Section</h3> 4: Benefits of this new bill would include:   Assurance that the person in question is still able to operate a vehicle.   Decrease in the number of automobile accidents.   Would provide revenue to the state government whether by reduction in costs related to automobile accidents or by money gained through the fine penalty charged to those who neglect to retake their driving test within the allotted amount of time. <h3>Section</h3> 5: When signed into law, the bill should begin to take affect on January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"Quinquennial Assessment of Driving Abilities","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KAgDOwwCEo3mtuvNA","rocketDocketStatus":"no","school":"Cougar New Tech","sponsor":" "},"-K3KAqRwqHeyJ_YuAQ6K":{"author1":"Wyatt OQuinn, Cameron Usry,","author2":"Roberto Zepahua","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: All South Carolina students should get the pleasure to experience Zaxbys or Chick-Fil-A school lunch every Monday. <h3>Section</h3> 2: Students that cannot afford this can apply for reduced price lunches. The food will be delivered to the school by Chick-Fil-A or a Zaxbys representative. <h3>Section</h3> 3: Revenue from this act would help to provide: A. Encourage students to attend school. B. Diverse school lunch. C. Students that are vegetarian can opt out or eat a healthy meatless salad from one of these restaurants.  D. Contributes to the business of those restaurants. <h3>Section</h3> 4: When signed into law, the first increase will take place on August 15, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to allow Zaxbys and Chick-Fil-A to provide school lunches every Monday in every school district in South Carolina.","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KAqRwqHeyJ_YuAQ6K","rocketDocketStatus":"no","school":"Colleton County High School","sponsor":" "},"-K3KB1uKkEOOn99gsOvT":{"author1":"Lance Calcutt, Rett Collins, Cameryn Coursen,","author2":"Susanna Seigler","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Currently in America, we have an exceeding amount of homeless citizens, so we will be creating a bill to assist the homeless community. <h3>Section</h3> 2:  We should add community gardens and more homeless shelters to all major cities in every state. These would include all capitols and all other major cities across the united states. <h3>Section</h3> 3:  We should do this because this would provide a better life for the suffering citizens and and help the economy by allowing the homeless to resurface and start a new life. This would also decrease the rate of theft because there would be no direct reason for someone to steal to be fed anymore now that they have a guaranteed meal every day. <h3>Section</h3> 4:  We could get funding from...    Statewide tax funds   Volunteer Organizations   Supplemental Nutrition Assistance Program <h3>Section</h3> 5:  Said bill would be passed the morning of January 12, 2016 so that it would be able to be put into action immediately after Christmas and new years day has calmed down.   SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"A New Bill To Assist The Homeless  An Act to Increase the Prosperity of the Homeless Community","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KB1uKkEOOn99gsOvT","rocketDocketStatus":"no","school":"Cougar New Tech","sponsor":" "},"-K3KBBNf7UqEfz8B9KMY":{"author1":"Robert Dent","author2":"Kourtney Jefferson","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: In South Carolinas school systems, there are approximately 4,759 teenage mothers between the ages of fifteen and nineteen every year. Teen pregnancies has been the lowest ever this year (only thirty-six births for every 1,000 girls between the age of fifteen and nineteen), but South Carolina is still in the top fifteen states for the highest teen pregnancy rates in the country. <h3>Section</h3> 2:  In Colleton County, sixty-eight teenage girls between the ages of fifteen and nineteen became mothers in the year of 2014. Twenty-seven percent of those children ended up falling under the line of poverty. <h3>Section</h3> 3:  In our school systems, teachers are not allowed to teach/speak about contraceptives (condoms, birth control, etc.) to their students, only abstinence. It should be legal to give students in all South Carolina high schools and middles school if needed. Funding for these contraceptives could come from cigarette taxes and local planned parenthood facilities in every county. Students do not need to get permission from their parents to receive the contraceptive. <h3>Section</h3> 4: Before the school can give any contraceptive to any student, which will only be handed out after school to prevent sex on school grounds, each student must sign a Notice of Liability saying that if the contraceptive is ineffective, the school is not liable for the pregnancy. The student or the students parents cannot sue the school for the ineffective contraceptive; they can only sue the contraceptive company. Students do not need to get their parents to sign this Notice of Liability. <h3>Section</h3> 5:  Passing this bill will improve: A. The overall teen pregnancy rate; B. Knowledge of safe sex; C. Poverty/crime rates.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"Better Safe Than Sorry  An Act to Prevent Teen Pregnancy","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KBBNf7UqEfz8B9KMY","rocketDocketStatus":"no","school":"Colleton County High School","sponsor":" "},"-K3KBrWZWvWmWTkDZfhU":{"author1":"Kayla White, Shakayla Gill, Karrington Reed, India Akins,","author2":"Caprina Smith","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1:  Currently, parents of all ages are allowed to drop babies off and abandon them at churches, school, family members homes, hospitals, and other places. <h3>Section</h3> 2:  We will be taking that action away from the parent/family member to save the children from the many dangers of being left in the street in hope of someone finding them before death. <h3>Section</h3> 3:  Every year, thousands of children are left in poor conditions due to parents that are unable to properly care for them. We will decrease the amount of children that go missing, get hurt, or end up in foster care by making it illegal to abandon their babies. These things cause taxes to rise, many kids to be homeless, and the death rate of minors in South Carolina to heighten. <h3>Section</h3> 4: Save the lives of minors:    Decrease the amount of minors that have been arrested for crimes due to no parental guidance or on the streets in gangs.   Help maintain death rates relating to gang violence, teenage criminals, and poor health care among minors.   Reduce the amount of adolescents that develop mental illness because they lack proper health-care or have experienced traumatic events such as being abandoned.   Will be used to strengthen and re-enforce the Safe Haven laws. <h3>Section</h3> 5:When signed into law, the bill will begin enforcement the 2016 year. SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Provide a safe place for kids","division":"PremierSenate","governorEvaluation":"not yet evaluated","id":"-K3KBrWZWvWmWTkDZfhU","rocketDocketStatus":"no","school":"Cougar New Tech Colleton County High School","sponsor":" "},"-K3KC4fA3s59hcxoClfC":{"author1":"Anni Crook, Olivia Phillips,","author2":"Deanna Munro","authorLocation":"not yet assigned","billLocation":"PC","billStatus":"on the docket","billText":"<h3>Section</h3>1: On August 13, 2013 the Columbia City Council approved the law of makinghomelessness illegal in the city of Columbia. <h3>Section</h3> 2: Current homeless shelters in Columbia are as follows:   City of Columbia Emergency Winter Shelter   Transitions - Homeless Recovery Center    Oliver Gospel Mission- Homeless Shelter    Womens Shelter- Main Street Columbia    His House Ministries Mission- Homeless Shelter    Alston Wilkes Society <h3>Section</h3> 3: Columbia should provide halfway houses (state funded houses) for homelesspeople so that they can get back a hold of their life. Halfway house will be funded from sales taxes on cigarettes, tobacco, and alcohol. In addition, half the income of homeless people living here will be used to pay for bills of the house. Moreover, homeless organizations will help to fund halfway houses when needed. These halfway houses should provide basic life needs, a place that holds job applications, and professional clothing in order to attend these job interviews.    However people that plan on taking refuge here will sign a contract saying that they will apply and get a job, will avoid trouble with the law, not participate in drug activities, and will only be allowed to take refuge here for one year, and then they will be told to leave.   For homeless people that disabled or unable to get a job will need to apply for disability, welfare, and food stamps. <h3>Section</h3> 4: Revenue from this act would help to provide: A. Homeless people with shelter. B. Homeless people with jobs. C. People being off the street. <h3>Section</h3> 5: When signed into law, the first increase will take place on January 1, 2016. South Carolina YMCA Youth in Government 28thAnnual Model Legislature November 1821, 2015","billTitle":"An Act to Repeal the Illegal Homelessness Law in Columbia, South Carolina","division":"PremierSenate","governorEvaluation":"not yet evaluated","id":"-K3KC4fA3s59hcxoClfC","rocketDocketStatus":"no","school":"Cougar New Tech","sponsor":" "},"-K3KC5lw-awmfzbJ7x2i":{"author1":"Maria Sellers","author2":"Colleen Taylor PREMIER SENATE","authorLocation":"not yet assigned","billLocation":"PD","billStatus":"on the docket","billText":"<h3>Section</h3>1:This bill will require all food establishments in South Carolina to provide the nutritional information of all of their menu items. <h3>Section</h3> 2:Many peopleinAmerica struggle with medical issues that require strict dietary monitoring. The increase in diabetes (both type 1 and type 2) and obesity has led to an increased need for nutritional information that food establishments currently are not providing. <h3>Section</h3> 3:Every food establishment in South Carolina will be required to provide the nutritional information for each item on their menu by December 31, 2017. The nutritional information required includes:   Serving size   Calories   Total fat   Saturated fat   Cholesterol   Sodium   Total carbohydrate   Sugars   Dietary fiber   Protein   Percent of daily value based on a 2000 calorie diet This can be posted on a website, menu, or displayed in clear view of all customers. Failure to comply by the aforementioned deadline will result in a $1500 fine and temporary termination until nutritional facts are made available. This will be enforced by state health inspectors as a part of their inspection. The restaurant owner is liable for meeting all of the aforementioned requirements. <h3>Section</h3> 4:If enacted, this bill will reduce challenges posed to those with dietary restrictions and improve the general health of South Carolina. This law will take effect on December 31, 2017.  SOUTH CAROLINA YMCAYOUTH TN GOVERNMENT27th Annual Model Legislature November18th-21st, 2015","billTitle":"An Act to Require Nutritional Information of Food Establishments in South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KC5lw-awmfzbJ7x2i","rocketDocketStatus":"no","school":"Wade Hampton High School","sponsor":""},"-K3KCDeOkaYsb8Y8U3u3":{"author1":"McKenley Webb","author2":"Ben Keith PREMIER SENATE","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1:Planned parenthood would be defunded, decreasing the amount of annual abortions and decreasing the amount of government spending. <h3>Section</h3> 2:Planned parenthood is slowly turning into a mass killing of zygotes and fetuses. Defunding this and redirecting the funds to preventing the pregnancies from occuring, is much more humane. <h3>Section</h3> 3: Because defunding planned parenthood would decrease the availability of easy abortion procedures, birth control and education on abstinence would be provided. <h3>Section</h3> 4:Money originally directed towards Planned Parenthood will be redirected towards increasing knowledge on abstinence and responsible sexual habits and government offering free or reduced cost birth control measures for low income women and/ or families for South Carolinian citizens. <h3>Section</h3> 5:When signed into law, Planned parenthood will be defunded effective immediately.  South Carolina YMCA Youth in Government 28thAnnual Model Legislature November 1821, 2015","billTitle":"Defunding Planned Parenthood","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KCDeOkaYsb8Y8U3u3","rocketDocketStatus":"no","school":"Wade Hampton High School","sponsor":""},"-K3KCDpTwwXl4iMkHtaI":{"author1":"John Howard","author2":"Faron Justice PREMIER SENATE","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1:South Carolina cafeterias are dumping nearly 40 million Styrofoam trays into landfills per year.This act is to replace those lunch trays with a biodegradable option made of sugar cane and bamboo. <h3>Section</h3> 2:These biodegradable lunch trays will cost slightly more than the styrofoam trays, but will effectively pay for themselves. By recycling these lunch trays, schools can save money which can be used to further a student's education. <h3>Section</h3> 3:The environmentally friendly trays will completely replace all other options in South Carolina schools. <h3>Section</h3> 4:These now lunch trays will:   Cut down cafeteria waste down by 30-50%;   Save schools money in landfill fees;   The trays will be recycled as mentioned in <h3>Section</h3> 2, and will make the world a cleaner place to live. <h3>Section</h3> 3:When signed into law, the first increase will take place on January 1, 2016.  South Carolina YMCA Youth in Government 28thAnnual Model Legislature November 1821, 2015","billTitle":"An Act to Use Compostable Lunch Trays","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KCDpTwwXl4iMkHtaI","rocketDocketStatus":"no","school":"Wade Hampton High School","sponsor":""},"-K3KCEvC6SZEyF9vZ4ND":{"author1":"Madyson Mitchell","author2":"Stuart Sadler PREMIER SENATE","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1:In public education in South Carolina, athletes are required to adhere to deadlines the same as non-athletes. This bill would allow athletes to submit assignments beyond the deadline not to extend a period of five days. <h3>Section</h3> 2:The purpose of this bill is to encourage students to become active in athletic extracurricular activities. <h3>Section</h3> 3:By extending the assignment deadlines, athletes would be less stressed about school. <h3>Section</h3> 4:This act would cause athletes to be more focused.   This would lead to improved grades and games for athletes.   It would also lead to less stress for athletes. <h3>Section</h3> 5:When signed into law, this bill will take effect on January 1st 2017  South Carolina YMCA Youth in Government 28thAnnual Model Legislature November 1821, 2015","billTitle":"An Act to Extend Due Dates For Athletes","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KCEvC6SZEyF9vZ4ND","rocketDocketStatus":"no","school":"Eastside High School","sponsor":""},"-K3KCFjoEZCIXfKwQP0Y":{"author1":"Vinnie Semsey","author2":"Sarah Blackmon","authorLocation":"not yet assigned","billLocation":"PF","billStatus":"on the docket","billText":"<h3>Section</h3>1:The average South Carolina public schools school day is seven hours. <h3>Section</h3> 2:This bill will decrease the number of hours in a school day to six hours. <h3>Section</h3> 3:The school day, being as long as it is, puts excessive stress on young students. Some adolescents do not have the attention span or ability to retain information when presented in this manner. Children and adolescents, for example, with Attention-Deficit Disorder (ADD) or Attention-Deficit Hyperactivity Disorder cannot fully function at this rate. The decrease in school hours will give students time to relax and not feel as overwhelmed, therefore, likely decreasing the amount of high school drop-outs. <h3>Section</h3> 4:Once in effect, not only will this take off some of the pressure off of school and decrease the drop-out rate, but it will give students the opportunity to join extra-curricular activities. These activities will engage students in problem-solving skills, teamwork, and good sportsmanship. <h3>Section</h3> 5:This bill will take effect in the 2016-2017 school year.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 27th Annual Model Legislature November 18th-21st, 2015","billTitle":"An Act to Decrease the Amount of School Hours","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KCFjoEZCIXfKwQP0Y","rocketDocketStatus":"no","school":"The Kings Academy","sponsor":"Sydney Conner"},"-K3KCORhNNh6iQu1VdDl":{"author1":"Asa LaBelle","author2":"Kate Windey","authorLocation":"not yet assigned","billLocation":"PG","billStatus":"on the docket","billText":"<h3>Section</h3>1: The current maximum penalty of 30 days jail for first time offenders  beating/abusing their intimate partners would be changed to 6 months to a year jail time. Offenders who violate the law in subsequent occasions will face a minimum penalty of 5 years and a fine of $5,000. <h3>Section</h3> 2: There are 36,000 incidents of domestic abuse in South carolina per year. In 2011, South Carolina ranked first in largest homicide rate among female victims killed by male offenders. South Carolinas rate of 2.54 per 100,000 was more than double the national average of 1.17 per 100,000. <h3>Section</h3> 3: Those who violate traffic laws will be required to pay up to ten extra dollars to their ticket, depending on the severity of the crime, in order to fund this act. Fines collected by this act will also go into funding this act. <h3>Section</h3> 4: The lengthening of the initial violation would result in a greater fear of violating the law which, in turn, decreases the amount of perpetrators and therefore amount of cases per year. <h3>Section</h3> 5: When signed into law, this bill will take effect on January 1, 2016.  SOUTH CAROLINA YMCA YOUTH IN GOVERNMENT 28th Annual Model Legislature November 18th- 21st","billTitle":"An Act to Increase the Penalty for Assault and Domestic Violence in South Carolina","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KCORhNNh6iQu1VdDl","rocketDocketStatus":"no","school":"Mauldin High School","sponsor":"Ben Hopkins"},"-K3KCYjefyclYRYm_Bae":{"author1":"Erin Russell","author2":"Serenity Dotson","authorLocation":"not yet assigned","billLocation":"PE","billStatus":"on the docket","billText":"<h3>Section</h3>1: The requirements to adopt from the Humane Society are only that potential owners bring a collar, leash, pet carrier, and money.  If you rent a house or apartment, you must have proof that you can have a pet. <h3>Section</h3> 2: Background checks will be required for anyone who wants to adopt from the Humane Society. If records include any criminals acts involving animals, the person will not be allow adopt. <h3>Section</h3> 3: The Humane Society will begin to run criminal background checks on potential owners after January 1, 2016.","billTitle":"The purpose for this bill is to prevent animals from being adopted by people who will not care of them and will treat them inhumanely","division":"Premier Senate","governorEvaluation":"not yet evaluated","id":"-K3KCYjefyclYRYm_Bae","rocketDocketStatus":"no","school":"Legacy Charter","sponsor":" "}}